mariopartyrd/marioparty4/src/REL/m401Dll/main.c
#include "game/chrman.h"
#include "game/disp.h"
#include "game/esprite.h"
#include "game/frand.h"
#include "game/gamework_data.h"
#include "game/hu3d.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "REL/m401Dll.h"
#include "ext_math.h"
#include "math.h"

#ifndef __MWERKS__
#include "game/audio.h"
#endif

float lbl_2_data_0 = -7.1875f;

s16 lbl_2_data_4[] = { 0, 1, 2, 3, 4, 5, 6, 7 };

Vec lbl_2_data_14 = { 1500, 2500, 1500 };

Vec lbl_2_data_20 = { 0, -1, 0 };

GXColor lbl_2_data_2C = { 255, 255, 255, 255 };

Vec lbl_2_data_30 = { 0, 2500, 0 };

Vec lbl_2_data_3C = { 0, 1, -1 };

Vec lbl_2_data_48 = { 0, 0, 0 };

s32 lbl_2_bss_11C;
OMOBJ **lbl_2_bss_118;
OMOBJ *lbl_2_bss_114;
OMOBJ *lbl_2_bss_110;
OMOBJ *lbl_2_bss_10C;
OMOBJ *lbl_2_bss_108;
OMOBJ *lbl_2_bss_100[2];
OMOBJ *lbl_2_bss_FC;
OMOBJ *lbl_2_bss_F8;
OMOBJ *lbl_2_bss_F4;
OMOBJ *lbl_2_bss_E4[4];
OMOBJ *lbl_2_bss_E0;
OMOBJ *lbl_2_bss_DC;
OMOBJ *lbl_2_bss_D8;
OMOBJ *lbl_2_bss_D4;
OMOBJ *lbl_2_bss_D0;
OMOBJ *lbl_2_bss_CC;
OMOBJ *lbl_2_bss_C8;
OMOBJ *lbl_2_bss_C4;
s16 lbl_2_bss_C0;
s16 lbl_2_bss_BE;
s16 lbl_2_bss_BC;
s16 lbl_2_bss_BA;
s16 lbl_2_bss_B2[4];
s16 lbl_2_bss_AA[4];
s16 lbl_2_bss_A8;
s32 lbl_2_bss_A4;
s32 lbl_2_bss_90[5];
s32 lbl_2_bss_8C;
float lbl_2_bss_88;
float lbl_2_bss_84;
Vec lbl_2_bss_78;
Vec lbl_2_bss_6C;
Vec lbl_2_bss_60;
Vec lbl_2_bss_54;
float lbl_2_bss_50;
Vec lbl_2_bss_44;
Vec lbl_2_bss_38;
Vec lbl_2_bss_2C;
Vec lbl_2_bss_20;
HUPROCESS *lbl_2_bss_1C;
s16 lbl_2_bss_1A;
s16 lbl_2_bss_18;
s32 lbl_2_bss_14;
float lbl_2_bss_10;
s16 lbl_2_bss_E;
s16 lbl_2_bss_C;
OMOBJ *lbl_2_bss_8;
OMOBJ *lbl_2_bss_4;
OMOBJ *lbl_2_bss_0;

void fn_2_70C(OMOBJ *object);
void fn_2_A10(OMOBJ *object);
void fn_2_C1C(OMOBJ *object);
void fn_2_11D0(OMOBJ *object);

void fn_2_2FA4(OMOBJ *object);
void initWorkPlayer(OMOBJ *plrObject);
void fn_2_48A0(OMOBJ *object);
void fn_2_7CB4(OMOBJ *object);
void fn_2_8E74(OMOBJ *object);
void fn_2_95E4(OMOBJ *object);
void fn_2_9D00(HUPROCESS *objman);
void fn_2_BD90(OMOBJ *object);
void fn_2_C130(OMOBJ *object);
void fn_2_C6DC(OMOBJ *object);
void fn_2_D088(OMOBJ *object);

void fn_2_DBCC(s16 arg0);

void ObjectSetup(void)
{
    s32 i;
    OMOBJ *object;
    HU3DCAMERA *camera;
    HU3DLIGHT *light;
    OSReport("**** M401ObjectSetup ****\n");
    HuMemHeapDump(HuMemHeapPtrGet(HEAP_HEAP), -1);
    HuMemHeapDump(HuMemHeapPtrGet(HEAP_MODEL), -1);
    HuMemHeapDump(HuMemHeapPtrGet(HEAP_DVD), -1);
    lbl_2_bss_1C = omInitObjMan(60, 8192);
    omGameSysInit(lbl_2_bss_1C);
    lbl_2_bss_A8 = Hu3DGLightCreateV(&lbl_2_data_14, &lbl_2_data_20, &lbl_2_data_2C);
    Hu3DGLightInfinitytSet(lbl_2_bss_A8);
    light = &Hu3DGlobalLight[lbl_2_bss_A8];
    light->type |= 0x8000;
    Hu3DCameraCreate(1);
    camera = &Hu3DCamera[0];
    Hu3DCameraViewportSet(1, 0, 0, 640, 480, 0, 1);
    lbl_2_bss_114 = omAddObjEx(lbl_2_bss_1C, 1000, 3, 0, -1, fn_2_BD90);
    lbl_2_bss_114->work[0] = 0;
    lbl_2_bss_110 = omAddObjEx(lbl_2_bss_1C, 10, 0, 0, -1, fn_2_70C);
    omMakeGroupEx(lbl_2_bss_1C, 0, 4);
    lbl_2_bss_118 = omGetGroupMemberListEx(lbl_2_bss_1C, 0);
    omMakeGroupEx(lbl_2_bss_1C, 1, 28);
    for (i = 0; i < 4; i++) {
        object = omAddObjEx(lbl_2_bss_1C, 1200, 4, 10, 0, initWorkPlayer);
        object->work[0] = i;
    }
    lbl_2_bss_12C = 60;
    lbl_2_bss_128 = 50;
    lbl_2_bss_124 = 25000;
    Hu3DShadowCreate(30, 20, 5000);
    Hu3DShadowTPLvlSet(0.35f);
    lbl_2_data_30.y = lbl_2_bss_60.y + 1500.0f;
    lbl_2_data_30.z = lbl_2_bss_60.z + 500.0f;
    lbl_2_data_48.y = lbl_2_bss_60.y;
    lbl_2_data_48.z = lbl_2_bss_60.z + 500.0f;
    Hu3DShadowPosSet(&lbl_2_data_30, &lbl_2_data_3C, &lbl_2_data_48);
    lbl_2_bss_10C = omAddObjEx(lbl_2_bss_1C, 500, 12, 3, -1, fn_2_2FA4);
    lbl_2_bss_108 = omAddObjEx(lbl_2_bss_1C, 1100, 1, 1, -1, fn_2_7CB4);
    lbl_2_bss_100[0] = omAddObjEx(lbl_2_bss_1C, 1110, 1, 1, -1, fn_2_8E74);
    lbl_2_bss_100[1] = omAddObjEx(lbl_2_bss_1C, 1110, 1, 1, -1, fn_2_8E74);
    lbl_2_bss_FC = omAddObjEx(lbl_2_bss_1C, 1120, 1, 2, -1, fn_2_95E4);
    lbl_2_bss_C8 = omAddObjEx(lbl_2_bss_1C, 100, 0, 0, -1, fn_2_D088);
    lbl_2_bss_E0 = omAddObjEx(lbl_2_bss_1C, 1500, 0, 0, -1, fn_2_C1C);
    fn_2_DBCC(90);
    lbl_2_bss_F8 = omAddObjEx(lbl_2_bss_1C, 500, 9, 0, -1, fn_2_C6DC);
    fn_2_9D00(lbl_2_bss_1C);
    fn_2_1041C();
    fn_2_1079C();
    lbl_2_bss_F4 = fn_2_14640(lbl_2_bss_1C);
    lbl_2_bss_50 = 0;
    lbl_2_bss_54 = camera->pos;
    Hu3DReflectNoSet(0);
    lbl_2_bss_120 = 0;
    lbl_2_bss_BE = 0;
    lbl_2_bss_BA = 0;
    Hu3DFogSet(3000, 10000, 10, 60, 160);
    Hu3DBGColorSet(10, 60, 160);
    lbl_2_bss_88 = 3000;
    lbl_2_bss_84 = 142000;
    lbl_2_bss_11C = HuAudFXPlay(1290);
}

void fn_2_70C(OMOBJ *plrObject)
{
    s32 temp_r31;
    M401WorkPlayer *plr;
    s16 temp_r29;
    switch (lbl_2_bss_120) {
        case 0:
            break;

        case 1:
            if (lbl_2_bss_BE == 1) {
                lbl_2_bss_120 = 2;
                lbl_2_bss_C0 = MGSeqFinishCreate();
                HuAudSeqFadeOut(lbl_2_bss_A4, 100);
            }
            break;

        case 2:
            if (lbl_2_bss_114 == NULL) {
                lbl_2_bss_114 = omAddObjEx(HuPrcCurrentGet(), 1000, 0, 0, -1, fn_2_C130);
                lbl_2_bss_114->work[0] = 0;
                temp_r29 = 0;
                lbl_2_bss_BA = 0;
                for (temp_r31 = 0; temp_r31 < 4; temp_r31++) {
                    plr = lbl_2_bss_118[temp_r31]->data;
                    lbl_2_bss_118[temp_r31]->objFunc = fn_2_48A0;
                    plr->unk0 = 5;
                    plr->unk68 = 0;
                    if (plr->coinCnt > temp_r29) {
                        temp_r29 = plr->coinCnt;
                    }
                    lbl_2_bss_B2[temp_r31] = -1;
                    lbl_2_bss_AA[temp_r31] = -1;
                }
                if (temp_r29 > 0) {
                    for (temp_r31 = 0; temp_r31 < 4; temp_r31++) {
                        plr = lbl_2_bss_118[temp_r31]->data;
                        if (plr->coinCnt == temp_r29) {
                            lbl_2_bss_AA[lbl_2_bss_BA] = GWPlayerCfg[temp_r31].character;
                            lbl_2_bss_B2[lbl_2_bss_BA++] = temp_r31;
                            plr->unk68 = 1;
                        }
                    }
                }
                OSReport("winnercnt:%d\n", lbl_2_bss_BA);
            }
            break;
    }
    if (omSysExitReq) {
        WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
        HuAudSeqFadeOut(lbl_2_bss_A4, 100);
        HuAudFXStop(lbl_2_bss_11C);
        plrObject->objFunc = fn_2_A10;
    }
}

void fn_2_A10(OMOBJ *object)
{
    s32 i;
    if (!WipeStatGet()) {
        fn_2_10710();
        for (i = 0; i < 4; i++) {
            CharModelKill(lbl_2_data_4[GWPlayerCfg[i].character]);
        }
        HuAudFXListnerKill();
        omOvlReturnEx(1, 1);
    }
}

void fn_2_A98(void)
{
    Hu3DFogSet(3000, 10000, 10, 60, 160);
    Hu3DBGColorSet(10, 60, 160);
}

typedef struct m401_work_2d {
    s16 unk0[4];
    s16 unk8[4][3];
    u8 unk20[0x30];
    s16 unk50[4][3];
    s16 unk68[4][3];
    s16 unk80[4];
    s16 unk88[4];
    float unk90[4];
    float unkA0[4];
    float unkB0[4];
    float unkC0[4];
    float unkD0[4];
    float unkE0[4];
    float unkF0[4];
    float unk100[4];
    float unk110[4];
    float unk120[4];
    s16 unk130[4];
    s16 unk138[4];
    s16 unk140[4];
} M401Work2D;

void fn_2_AEC(s16 arg0)
{
    M401Work2D *temp_r31;
    s32 i;
    s32 j;
    temp_r31 = lbl_2_bss_E0->data;
    if (arg0) {
        for (i = 0; i < 4; i++) {
            espDispOn(temp_r31->unk0[i]);
            espDispOn(temp_r31->unk80[i]);
            espDispOn(temp_r31->unk88[i]);
            for (j = 0; j < 2; j++) {
                espDispOn(temp_r31->unk8[i][j]);
            }
        }
    }
    else {
        for (i = 0; i < 4; i++) {
            espDispOff(temp_r31->unk0[i]);
            espDispOff(temp_r31->unk80[i]);
            espDispOff(temp_r31->unk88[i]);
            for (j = 0; j < 2; j++) {
                espDispOff(temp_r31->unk8[i][j]);
            }
        }
    }
}

s32 lbl_2_data_80[] = {
    DATA_MAKE_NUM(DATADIR_MGCONST, 0x00),
    DATA_MAKE_NUM(DATADIR_MGCONST, 0x01),
    DATA_MAKE_NUM(DATADIR_MGCONST, 0x02),
    DATA_MAKE_NUM(DATADIR_MGCONST, 0x03),
    DATA_MAKE_NUM(DATADIR_MGCONST, 0x04),
    DATA_MAKE_NUM(DATADIR_MGCONST, 0x05),
    DATA_MAKE_NUM(DATADIR_MGCONST, 0x06),
    DATA_MAKE_NUM(DATADIR_MGCONST, 0x07),
};

