mariopartyrd/marioparty4/src/REL/m401Dll/main.c
#define PLAYER_POS_X(index, left, width) ((((index)&1) * width) + left)
#define PLAYER_POS_Y(index, top, height) ((((index) > 1) * height) + top)

void fn_2_C1C(OMOBJ *object)
{
    M401Work2D *temp_r31;
    s32 i;
    s32 j;
    object->data = HuMemDirectMallocNum(HEAP_HEAP, sizeof(M401Work2D), HU_MEMNUM_OVL);
    temp_r31 = object->data;
    for (i = 0; i < 4; i++) {
        temp_r31->unk0[i] = espEntry(lbl_2_data_80[GWPlayerCfg[i].character], 2, 0);
        espDispOff(temp_r31->unk0[i]);
        espDrawNoSet(temp_r31->unk0[i], 0);
        espPosSet(temp_r31->unk0[i], PLAYER_POS_X(i, 37, 438), PLAYER_POS_Y(i, 59, 358));
        temp_r31->unk80[i] = espEntry(DATA_MAKE_NUM(DATADIR_M401, 0x2F), 3, 0);
        espDispOff(temp_r31->unk80[i]);
        espDrawNoSet(temp_r31->unk80[i], 0);
        espPosSet(temp_r31->unk80[i], PLAYER_POS_X(i, 73, 438), PLAYER_POS_Y(i, 61, 358));
        temp_r31->unk88[i] = espEntry(DATA_MAKE_NUM(DATADIR_M401, 0x30), 4, 0);
        espDispOff(temp_r31->unk88[i]);
        espDrawNoSet(temp_r31->unk88[i], 0);
        espPosSet(temp_r31->unk88[i], PLAYER_POS_X(i, 73, 438), PLAYER_POS_Y(i, 61, 358));
        espColorSet(temp_r31->unk88[i], 0, 0, 0);
        espTPLvlSet(temp_r31->unk88[i], 0.5f);
        for (j = 0; j < 2; j++) {
            temp_r31->unk8[i][j] = espEntry(DATA_MAKE_NUM(DATADIR_M401, 0x2E), 1, 0);
            espDispOff(temp_r31->unk8[i][j]);
            espDrawNoSet(temp_r31->unk8[i][j], 0);
            espPosSet(temp_r31->unk8[i][j], PLAYER_POS_X(i, 69 + (j * 20), 438), PLAYER_POS_Y(i, 63, 358));
            espAttrSet(temp_r31->unk8[i][j], HUSPR_ATTR_NOANIM);
        }
        for (j = 0; j < 3; j++) {
            temp_r31->unk50[i][j] = espEntry(DATA_MAKE_NUM(DATADIR_M401, 0x2D), 0, 0);
            espDispOff(temp_r31->unk50[i][j]);
            espDrawNoSet(temp_r31->unk50[i][j], 0);
            espAttrSet(temp_r31->unk50[i][j], HUSPR_ATTR_NOANIM);
            temp_r31->unk68[i][j] = espEntry(DATA_MAKE_NUM(DATADIR_M401, 0x2D), 0, 0);
            espDispOff(temp_r31->unk68[i][j]);
            espDrawNoSet(temp_r31->unk68[i][j], 0);
            espAttrSet(temp_r31->unk68[i][j], HUSPR_ATTR_NOANIM);
        }
        espBankSet(temp_r31->unk50[i][0], 10);
        espBankSet(temp_r31->unk68[i][0], 11);
        temp_r31->unk90[i] = 1.0f;
        temp_r31->unkA0[i] = 1.0f;
        temp_r31->unk130[i] = 0;
        temp_r31->unk138[i] = 0;
    }
    object->objFunc = fn_2_11D0;
}

void fn_2_15C4(s16 arg0);

void fn_2_11D0(OMOBJ *object)
{
    M401Work2D *temp_r31;
    s32 i;
    s32 j;
    OMOBJ *temp_r28;
    Vec sp18;
    Vec spC;
    M401WorkPlayer *sp8;
    temp_r31 = object->data;
    for (i = 0; i < 4; i++) {
        sp8 = lbl_2_bss_118[i]->data;
        if (temp_r31->unk130[i]) {
            temp_r28 = lbl_2_bss_118[i];
            sp18.x = temp_r28->trans.x;
            sp18.y = temp_r28->trans.y;
            sp18.z = temp_r28->trans.z;
            fn_2_10240(&sp18, &spC);
            for (j = 0; j < 3; j++) {
                espPosSet(temp_r31->unk50[i][j], (-20.0f + spC.x + temp_r31->unkF0[i]) + (j * 16), 20.0f + spC.y + temp_r31->unk100[i]);
                espTPLvlSet(temp_r31->unk50[i][j], temp_r31->unk90[i]);
            }
            temp_r31->unkC0[i] -= 0.5f;
            temp_r31->unk100[i] -= 1.0f;
            if (temp_r31->unk130[i] < 15) {
                temp_r31->unk90[i] -= 1.0f / 15.0f;
            }
            if (--temp_r31->unk130[i] == 0) {
                espDispOff(temp_r31->unk50[i][0]);
                espDispOff(temp_r31->unk50[i][1]);
            }
        }
        if (temp_r31->unk138[i]) {
            temp_r28 = lbl_2_bss_118[i];
            sp18.x = temp_r28->trans.x;
            sp18.y = temp_r28->trans.y;
            sp18.z = temp_r28->trans.z;
            fn_2_10240(&sp18, &spC);
            for (j = 0; j < 2; j++) {
                espPosSet(temp_r31->unk68[i][j], (-20.0f + spC.x + temp_r31->unk110[i]) + (j * 16), -20.0f + spC.y + temp_r31->unk120[i]);
                espTPLvlSet(temp_r31->unk68[i][j], temp_r31->unkA0[i]);
            }
            temp_r31->unkE0[i] += 0.5f;
            temp_r31->unk120[i] += 1.0f;
            if (temp_r31->unk138[i] < 15) {
                temp_r31->unkA0[i] -= 1.0f / 15.0f;
            }
            if (--temp_r31->unk138[i] == 0) {
                espDispOff(temp_r31->unk68[i][0]);
                espDispOff(temp_r31->unk68[i][1]);
            }
        }
        fn_2_15C4(i);
    }
}

void fn_2_15C4(s16 arg0)
{
    M401Work2D *temp_r31;
    s32 temp_r30;
    M401WorkPlayer *plr;
    temp_r31 = lbl_2_bss_E0->data;
    plr = lbl_2_bss_118[arg0]->data;
    temp_r30 = plr->coinCnt;
    espBankSet(temp_r31->unk8[arg0][0], temp_r30 / 10);
    espBankSet(temp_r31->unk8[arg0][1], temp_r30 % 10);
}

void fn_2_169C(s16 arg0)
{
    M401Work2D *temp_r31;
    s32 i;
    M401WorkPlayer *temp_r28;
    temp_r31 = lbl_2_bss_E0->data;
    temp_r28 = lbl_2_bss_118[arg0]->data;
    for (i = 0; i < 2; i++) {
        espDispOn(temp_r31->unk50[arg0][i]);
    }
    temp_r31->unk90[arg0] = 1;
    temp_r31->unkC0[arg0] = PLAYER_POS_Y(arg0, 52, 398);
    temp_r31->unkB0[arg0] = PLAYER_POS_X(arg0, 41, 442);
    temp_r31->unk100[arg0] = 0;
    temp_r31->unkF0[arg0] = 0;
    espBankSet(temp_r31->unk50[arg0][1], temp_r28->unk74);
    temp_r31->unk130[arg0] = 45;
}

void fn_2_1858(s16 arg0, s16 arg1)
{
    M401Work2D *temp_r31;
    M401WorkPlayer *plr;
    s32 i;
    temp_r31 = lbl_2_bss_E0->data;
    plr = lbl_2_bss_118[arg0]->data;
    for (i = 0; i < 2; i++) {
        espDispOn(temp_r31->unk68[arg0][i]);
    }
    temp_r31->unkA0[arg0] = 1;
    temp_r31->unkE0[arg0] = PLAYER_POS_Y(arg0, 20, 398);
    temp_r31->unkD0[arg0] = PLAYER_POS_X(arg0, 41, 442);
    temp_r31->unk120[arg0] = 0;
    temp_r31->unk110[arg0] = 0;
    espBankSet(temp_r31->unk68[arg0][1], arg1);
    temp_r31->unk138[arg0] = 45;
    temp_r31->unk140[arg0] = arg1;
    plr->coinCnt -= arg1;
    if (plr->coinCnt < 0) {
        plr->coinCnt = 0;
    }
}

float lbl_2_data_A0[] = { -500, -8500, -17500, -26500, -99000 };

float lbl_2_data_B4[] = { -9100, -18100, -27100, -36100, -45100, -100000 };

