mariopartyrd/marioparty4/src/REL/m401Dll/main.c
void fn_2_1A38(OMOBJ *object);
void fn_2_1B80(OMOBJ *object);
void fn_2_1CF0(OMOBJ *object);
void fn_2_1DE8(OMOBJ *object);
void fn_2_20B0(OMOBJ *object);
void fn_2_2CBC(OMOBJ *object);
void fn_2_2D64(OMOBJ *object);
void fn_2_2DCC(OMOBJ *object);
void fn_2_2E20(OMOBJ *object);
void fn_2_2ED0(OMOBJ *object);

OMOBJFUNC lbl_2_data_CC[][2] = { fn_2_1A38, fn_2_2CBC, fn_2_1B80, fn_2_2D64, fn_2_1CF0, fn_2_2DCC, fn_2_1DE8, fn_2_2E20, fn_2_20B0, fn_2_2ED0 };

char *lbl_2_data_124[] = { "kaitei01", "kaitei02", "kaitei03", "kaitei04", "kaitei05" };

s32 lbl_2_data_138[] = {
    DATA_MAKE_NUM(DATADIR_MARIO, 0x02),
    DATA_MAKE_NUM(DATADIR_MARIO, 0x02),
    DATA_MAKE_NUM(DATADIR_MARIO, 0x02),
    DATA_MAKE_NUM(DATADIR_MARIO, 0x02),
    DATA_MAKE_NUM(DATADIR_MARIO, 0x02),
    DATA_MAKE_NUM(DATADIR_MARIO, 0x02),
    DATA_MAKE_NUM(DATADIR_MARIO, 0x02),
    DATA_MAKE_NUM(DATADIR_MARIO, 0x02),
};

OMOBJ *fn_2_FC40(s16 arg0, Vec *arg1, Vec *arg2, Vec *arg3);
void fn_2_E6BC(OMOBJ *object, float arg2, float arg3, float arg4, float arg5, float arg6);

void fn_2_1A38(OMOBJ *object)
{
    Vec sp20;
    Vec sp14;
    Vec sp8;
    HSFOBJECT *temp_r31 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[0]);
    OMOBJ *temp_r30;
    temp_r31->type = 2;
    sp20.x = -2500;
    sp20.y = 150;
    sp20.z = -6800;
    sp14.x = 50;
    sp14.y = 50;
    sp14.z = 50;
    sp8.x = 1500;
    sp8.y = 150;
    sp8.z = -4800;
    temp_r30 = fn_2_FC40(18, &sp20, &sp14, &sp8);
    fn_2_E6BC((OMOBJ *)temp_r30->work[0], 5, 1.5, 0.2, 0.8, 3);
}

void fn_2_1B80(OMOBJ *object)
{
    Vec sp14;
    Vec sp8;
    OMOBJ *temp_r31;
    HSFOBJECT *temp_r30 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[1]);
    temp_r30->type = 2;
    sp14.x = -1000;
    sp14.y = 0;
    sp14.z = -9100;
    sp8.x = 150;
    sp8.y = 100;
    sp8.z = 100;
    temp_r31 = fn_2_FC40(14, &sp14, &sp8, &sp14);
    omSetRot(temp_r31, 3, 0, 0);
    omSetSca(temp_r31, 0, 0, 50);
    fn_2_E6BC((OMOBJ *)temp_r31->work[0], 4.5, 2.5, 0.08, 0.9, 1);
}

void fn_2_1CF0(OMOBJ *object)
{
    Vec sp20;
    Vec sp14;
    Vec sp8;
    HSFOBJECT *temp_r31 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[2]);
    temp_r31->type = 2;
    sp20.x = 500;
    sp20.y = 0;
    sp20.z = -24300;
    sp14.x = 200;
    sp14.y = 100;
    sp14.z = 100;
    sp8.x = 1000;
    sp8.y = 0;
    sp8.z = -16300;
    fn_2_FC40(40, &sp20, &sp14, &sp8);
}

void fn_2_91AC(OMOBJ *object, Vec *pos);

void fn_2_1DE8(OMOBJ *object)
{
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;
    OMOBJ *temp_r31;
    HSFOBJECT *temp_r30 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[3]);
    temp_r30->type = 2;
    sp2C.x = 0;
    sp2C.y = -150.0f + ((1.0f / 255.0f) * (300.0f * frandu8()));
    sp2C.z = -23000;
    fn_2_91AC(lbl_2_bss_100[0], &sp2C);
    sp2C.x = 0;
    sp2C.y = -150.0f + ((1.0f / 255.0f) * (300.0f * frandu8()));
    sp2C.z = -25000;
    fn_2_91AC(lbl_2_bss_100[1], &sp2C);
    sp2C.x = 5500;
    sp2C.y = 0;
    sp2C.z = -29800;
    sp20.x = 100;
    sp20.y = 100;
    sp20.z = 100;
    sp14.x = -1500;
    sp14.y = 0;
    sp14.z = -24900;
    temp_r31 = fn_2_FC40(20, &sp2C, &sp20, &sp14);
    fn_2_E6BC((OMOBJ *)temp_r31->work[0], 6, 1.5f, 0.2f, 0.8f, 3.5f);
    sp8.x = -650;
    sp8.y = -360;
    sp8.z = -26300;
    lbl_2_bss_D0 = fn_2_10A88(&sp8, 3);
    lbl_2_bss_90[0] = HuAudFXEmiterPlay(1291, &sp8);
}

void fn_2_20B0(OMOBJ *object)
{
    Vec sp8;
    HSFOBJECT *temp_r30 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[4]);
    temp_r30->type = 2;
    Hu3DModelAttrReset(object->mdlId[7], HU3D_ATTR_DISPOFF);
    sp8.x = 0;
    sp8.y = -370;
    sp8.z = -43000;
    lbl_2_bss_8 = fn_2_10A88(&sp8, 3);
    lbl_2_bss_90[1] = HuAudFXEmiterPlay(1291, &sp8);
    sp8.x = 380;
    sp8.y = -440;
    sp8.z = -32000;
    lbl_2_bss_CC = fn_2_10A88(&sp8, 3);
    lbl_2_bss_90[2] = HuAudFXEmiterPlay(1291, &sp8);
    Hu3DModelAttrReset(object->mdlId[2], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->mdlId[2], HU3D_CLUSTER_ATTR_LOOP);
}

void fn_2_21F8(OMOBJ *object)
{
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;
    s32 temp_r30;
    HSFOBJECT *temp_r29 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[0]);
    s32 temp_r28;
    temp_r29->type = 2;
    Hu3DModelAttrReset(object->mdlId[0], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrReset(object->mdlId[1], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->mdlId[0], HU3D_MOTATTR_LOOP);
    Hu3DModelAttrSet(object->mdlId[1], HU3D_MOTATTR_LOOP);
    Hu3DModelAttrReset(object->mdlId[3], HU3D_ATTR_DISPOFF);
    lbl_2_bss_44.x = 0;
    lbl_2_bss_44.y = 100;
    lbl_2_bss_44.z = 0;
    lbl_2_bss_38.x = 0;
    lbl_2_bss_38.y = 1000;
    lbl_2_bss_38.z = -1500;
    lbl_2_bss_2C.x = 0;
    lbl_2_bss_2C.y = 1;
    lbl_2_bss_2C.z = 0;
    Hu3DCameraPosSetV(1, &lbl_2_bss_44, &lbl_2_bss_2C, &lbl_2_bss_38);
    Hu3DCameraPerspectiveSet(1, lbl_2_bss_12C, lbl_2_bss_128, lbl_2_bss_124, 1.2f);
    lbl_2_bss_54 = lbl_2_bss_44;
    fn_2_D088(NULL);
    sp20 = lbl_2_bss_44;
    VECSubtract(&lbl_2_bss_38, &lbl_2_bss_44, &sp2C);
    VECNormalize(&sp2C, &sp2C);
    HuAudFXListnerSetEX(&sp20, &sp2C, lbl_2_bss_88, lbl_2_bss_84, 300, 300, 300);
    sp14.x = 300;
    sp14.y = -450;
    sp14.z = -3100;
    lbl_2_bss_D8 = fn_2_10A88(&sp14, 3);
    lbl_2_bss_90[0] = HuAudFXEmiterPlay(1291, &sp14);
    sp14.x = -300;
    sp14.y = -340;
    sp14.z = -4720;
    lbl_2_bss_D4 = fn_2_10A88(&sp14, 3);
    lbl_2_bss_90[1] = HuAudFXEmiterPlay(1291, &sp14);
    Hu3DModelAttrReset(object->mdlId[2], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->mdlId[2], HU3D_CLUSTER_ATTR_LOOP);
    temp_r28 = 4;
    for (temp_r30 = 0; temp_r30 < temp_r28; temp_r30++) {
        sp8.x = -340.0f + ((1.0f / 255.0f) * (680.0f * frandu8()));
        sp8.y = -250.0f + ((1.0f / 255.0f) * (500.0f * frandu8()));
        sp8.z = ((-1550.0f - (temp_r30 * 260)) - 40.0f) + ((1.0f / 255.0f) * (80.0f * frandu8()));
        fn_2_10A88(&sp8, 0);
    }
}

typedef struct work_2FA4 {
    s32 unk0;
    float unk4;
    Vec unk8;
    Vec unk14[2];
    s16 unk2C;
} Work2FA4;

void fn_2_26E0(OMOBJ *object)
{
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;
    Work2FA4 *temp_r30;
    s32 temp_r29;
    Hu3DModelAttrReset(object->mdlId[4], HU3D_ATTR_DISPOFF);
    Hu3DModelClusterAttrSet(object->mdlId[4], 0, 0xC0000001);
    Hu3DModelAttrReset(object->mdlId[8], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->mdlId[8], HU3D_MOTATTR_LOOP);
    Hu3DModelAttrSet(object->mdlId[4], HU3D_MOTATTR_LOOP);
    Hu3DModelShadowMapSet(object->mdlId[4]);
    Hu3DModelAttrReset(object->mdlId[5], HU3D_ATTR_DISPOFF);
    Hu3DModelPosSet(object->mdlId[4], 0, 0, 0);
    Hu3DModelAmbSet(object->mdlId[4], 1, 1, 1);
    Hu3DModelPosSet(object->mdlId[5], 0, 0, 0);
    Hu3DModelPosSet(object->mdlId[6], 0, 0, 0);
    temp_r30 = lbl_2_bss_10C->data;
    if (lbl_2_bss_BA) {
        temp_r30->unk14[0].x = 210;
        temp_r30->unk14[0].y = 1018;
        temp_r30->unk14[0].z = 0;
        temp_r30->unk14[1].x = -160;
        temp_r30->unk14[1].y = 1020;
        temp_r30->unk14[1].z = -50;
        for (temp_r29 = 0; temp_r29 < 2; temp_r29++) {
            Hu3DModelPosSet(object->mdlId[temp_r29 + 9], temp_r30->unk14[temp_r29].x, temp_r30->unk14[temp_r29].y, temp_r30->unk14[temp_r29].z);
            Hu3DModelAttrReset(object->mdlId[temp_r29 + 9], HU3D_ATTR_DISPOFF);
        }
        Hu3DMotionSet(object->mdlId[10], object->mtnId[0]);
        Hu3DMotionSet(object->mdlId[9], object->mtnId[2]);
    }
    else {
        temp_r30->unk14[0].x = 210;
        temp_r30->unk14[0].y = 1018;
        temp_r30->unk14[0].z = 0;
        temp_r30->unk14[1].x = -160;
        temp_r30->unk14[1].y = 1020;
        temp_r30->unk14[1].z = -50;
        for (temp_r29 = 0; temp_r29 < 2; temp_r29++) {
            Hu3DModelPosSet(object->mdlId[temp_r29 + 9], temp_r30->unk14[temp_r29].x, temp_r30->unk14[temp_r29].y, temp_r30->unk14[temp_r29].z);
            Hu3DModelAttrReset(object->mdlId[temp_r29 + 9], HU3D_ATTR_DISPOFF);
        }
        Hu3DMotionSet(object->mdlId[10], object->mtnId[1]);
        Hu3DMotionSet(object->mdlId[9], object->mtnId[2]);
    }
    Hu3DModelAttrSet(object->mdlId[9], HU3D_MOTATTR_LOOP);
    Hu3DModelAttrSet(object->mdlId[10], HU3D_MOTATTR_LOOP);
    Hu3DModelRotSet(object->mdlId[9], 0, 90, 0);
    Hu3DModelPosSet(object->mdlId[11], 210, 1018, 0);
    Hu3DModelRotSet(object->mdlId[11], 0, 90, 0);
    Hu3DModelAttrReset(object->mdlId[11], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->mdlId[11], HU3D_MOTATTR_LOOP);
    sp2C.x = 0;
    sp2C.y = 1300;
    sp2C.z = 1300;
    sp20.x = 0;
    sp20.y = 920;
    sp20.z = -100;
    sp14.x = 0;
    sp14.y = 1;
    sp14.z = 0;
    Hu3DCameraPosSetV(1, &sp2C, &sp14, &sp20);
    lbl_2_bss_12C = 45;
    Hu3DShadowData.fov = lbl_2_bss_12C;
    MTXLightPerspective(Hu3DShadowData.projMtx, lbl_2_bss_12C, 1.2f, 0.5f, -0.5f, 0.5f, 0.5f);
    Hu3DCameraPerspectiveSet(1, lbl_2_bss_12C, lbl_2_bss_128, lbl_2_bss_124, 1.2f);
    VECSubtract(&sp20, &sp2C, &sp8);
    VECNormalize(&sp8, &sp8);
    HuAudFXListnerUpdate(&sp2C, &sp8);
}

void fn_2_2CBC(OMOBJ *object)
{
    HSFOBJECT *temp_r30 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[0]);
    temp_r30->type = -1;
    Hu3DModelAttrSet(object->mdlId[3], HU3D_ATTR_DISPOFF);
    lbl_2_bss_D8->work[0] = 1;
    Hu3DModelAttrSet(object->mdlId[2], HU3D_ATTR_DISPOFF);
    HuAudFXStop(lbl_2_bss_90[0]);
    HuAudFXStop(lbl_2_bss_90[1]);
}

void fn_2_2D64(OMOBJ *object)
{
    HSFOBJECT *temp_r31 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[1]);
    temp_r31->type = -1;
    lbl_2_bss_D4->work[0] = 1;
}

void fn_2_2DCC(OMOBJ *object)
{
    HSFOBJECT *temp_r31 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[2]);
    temp_r31->type = -1;
}

void fn_2_2E20(OMOBJ *object)
{
    HSFOBJECT *temp_r30 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[3]);
    temp_r30->type = -1;
    Hu3DModelAttrSet(lbl_2_bss_100[0]->mdlId[0], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(lbl_2_bss_100[1]->mdlId[0], HU3D_ATTR_DISPOFF);
    lbl_2_bss_D0->work[0] = 1;
    HuAudFXStop(lbl_2_bss_90[0]);
}

