mariopartyrd/marioparty4/src/REL/m401Dll/main.c
void fn_2_2ED0(OMOBJ *object)
{
    HSFOBJECT *temp_r30 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[4]);
    temp_r30->type = -1;
    Hu3DModelAttrSet(object->mdlId[7], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->mdlId[0], HU3D_ATTR_DISPOFF);
    lbl_2_bss_8->work[0] = 1;
    lbl_2_bss_CC->work[0] = 1;
    Hu3DModelAttrSet(object->mdlId[2], HU3D_ATTR_DISPOFF);
    HuAudFXStop(lbl_2_bss_90[1]);
    HuAudFXStop(lbl_2_bss_90[2]);
}

void fn_2_2F9C(OMOBJ *object) { }

void fn_2_2FA0(OMOBJ *object) { }

void fn_2_33B4(OMOBJ *object);

void fn_2_2FA4(OMOBJ *object)
{
    Work2FA4 *temp_r30;
    s32 temp_r29;
    HSFOBJECT *temp_r28;
    object->data = HuMemDirectMallocNum(HEAP_HEAP, sizeof(Work2FA4), HU_MEMNUM_OVL);
    temp_r30 = object->data;
    fn_2_D088(NULL);
    temp_r30->unk0 = 0;
    temp_r30->unk8.x = 0;
    temp_r30->unk8.y = 0;
    temp_r30->unk8.z = 0;
    temp_r30->unk2C = 0;
    object->mdlId[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x00));
    Hu3DModelAttrSet(object->mdlId[0], HU3D_ATTR_DISPOFF);
    object->mdlId[1] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x01));
    Hu3DModelAttrSet(object->mdlId[1], HU3D_ATTR_DISPOFF);
    object->mdlId[2] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x07));
    Hu3DModelAttrSet(object->mdlId[2], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->mdlId[2], HU3D_MOTATTR_LOOP);
    object->mdlId[3] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x1F));
    Hu3DModelAttrSet(object->mdlId[3], HU3D_ATTR_DISPOFF);
    object->mdlId[4] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x20));
    Hu3DModelAttrSet(object->mdlId[4], HU3D_ATTR_DISPOFF);
    object->mdlId[11] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x2C));
    Hu3DModelAttrSet(object->mdlId[11], HU3D_ATTR_DISPOFF);
    object->mdlId[7] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x03));
    Hu3DModelAttrSet(object->mdlId[7], HU3D_ATTR_DISPOFF);
    object->mdlId[8] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x23));
    Hu3DModelAttrSet(object->mdlId[8], HU3D_ATTR_DISPOFF);
    object->mdlId[9] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x28));
    Hu3DModelAttrSet(object->mdlId[9], HU3D_ATTR_DISPOFF);
    object->mdlId[10] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x28));
    Hu3DModelAttrSet(object->mdlId[10], HU3D_ATTR_DISPOFF);
    Hu3DModelShadowSet(object->mdlId[10]);
    object->mdlId[5] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x21));
    Hu3DModelAttrSet(object->mdlId[5], HU3D_ATTR_DISPOFF);
    object->mdlId[6] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x22));
    Hu3DModelAttrSet(object->mdlId[6], HU3D_ATTR_DISPOFF);
    object->mtnId[0] = Hu3DJointMotionFile(object->mdlId[10], DATA_MAKE_NUM(DATADIR_M401, 0x29));
    object->mtnId[1] = Hu3DJointMotionFile(object->mdlId[10], DATA_MAKE_NUM(DATADIR_M401, 0x2A));
    object->mtnId[2] = Hu3DJointMotionFile(object->mdlId[9], DATA_MAKE_NUM(DATADIR_M401, 0x2B));
    Hu3DModelPosSet(object->mdlId[1], 0, 0, -1500);
    Hu3DModelShadowMapSet(object->mdlId[0]);
    for (temp_r29 = 0; temp_r29 < 5; temp_r29++) {
        temp_r28 = Hu3DModelObjPtrGet(object->mdlId[0], lbl_2_data_124[temp_r29]);
        temp_r28->type = -1;
    }
    fn_2_21F8(object);
    object->objFunc = fn_2_33B4;
}

void fn_2_33B4(OMOBJ *object)
{
    Hu3DModelPosSet(object->mdlId[3], 110, 5.0 * sind(lbl_2_bss_10), -1500);
    lbl_2_bss_10 += 2.0f;
    if (lbl_2_bss_10 >= 360.0f) {
        lbl_2_bss_10 -= 360.0f;
    }
}

void fn_2_9E28(float arg1, float arg2);

void fn_2_34B8(OMOBJ *object)
{
    Vec sp8;
    Work2FA4 *temp_r31;
    s32 temp_r30;
    s32 temp_r28;
    temp_r31 = object->data;
    if (lbl_2_bss_60.z < -5000.0f && temp_r31->unk0 == 0) {
        temp_r31->unk0 = 1;
        fn_2_9E28(-15500, -20000);
    }
    if (lbl_2_bss_6C.z <= lbl_2_data_A0[lbl_2_bss_C]) {
        lbl_2_bss_C++;
        lbl_2_data_CC[lbl_2_bss_C][0](object);
    }
    if (lbl_2_bss_6C.z <= lbl_2_data_B4[lbl_2_bss_E]) {
        lbl_2_data_CC[lbl_2_bss_E][1](object);
        lbl_2_bss_E++;
    }
    if (lbl_2_bss_6C.z <= -40000.0f) {
        lbl_2_bss_BE = 1;
    }
    if (temp_r31->unk2C) {
        temp_r31->unk2C--;
    }
    else {
        temp_r31->unk2C = 274;
        if (lbl_2_bss_60.z > -31260.0f) {
            temp_r28 = 4;
            for (temp_r30 = 0; temp_r30 < temp_r28; temp_r30++) {
                sp8.x = -340.0f + ((1.0f / 255.0f) * (680.0f * frandu8()));
                sp8.y = -250.0f + ((1.0f / 255.0f) * (500.0f * frandu8()));
                sp8.z = ((-4000.0f - (temp_r30 * 240)) - 40.0f) + ((1.0f / 255.0f) * (80.0f * frandu8()));
                fn_2_10A88(&sp8, 0);
            }
        }
    }
}

void fn_2_3838(OMOBJ *object)
{
    Work2FA4 *temp_r31;
    s32 temp_r29;
    float temp_f31;
    temp_r31 = object->data;
    temp_r31->unk4 = 5.0 * sind(temp_r31->unk8.x);
    temp_r31->unk8.y += temp_r31->unk8.z;
    Hu3DModelPosSet(object->mdlId[4], temp_r31->unk8.y, temp_r31->unk4, 0);
    Hu3DModelPosSet(object->mdlId[5], temp_r31->unk8.y, 0, 0);
    Hu3DModelScaleSet(object->mdlId[5], 1.0f - (0.09f * (temp_r31->unk4 / 5.0f)), 1.0f, 1.0f - (0.09f * (temp_r31->unk4 / 5.0f)));
    for (temp_r29 = 0; temp_r29 < 2; temp_r29++) {
        temp_f31 = temp_r31->unk14[temp_r29].y + (5.0 * sind(temp_r31->unk8.x));
        temp_r31->unk14[temp_r29].x += temp_r31->unk8.z;
        Hu3DModelPosSet(object->mdlId[temp_r29 + 9], temp_r31->unk14[temp_r29].x, temp_f31, temp_r31->unk14[temp_r29].z);
    }
    Hu3DModelPosSet(object->mdlId[11], temp_r31->unk14[0].x, temp_f31, temp_r31->unk14[0].z);
    temp_r31->unk8.z *= 1.04f;
    if (temp_r31->unk8.z > 12.0f) {
        temp_r31->unk8.z = 12.0f;
    }
    temp_r31->unk8.x += 2.0f;
    if (temp_r31->unk8.x >= 360.0f) {
        temp_r31->unk8.x -= 360.0f;
    }
    lbl_2_data_30.x = temp_r31->unk8.y;
    lbl_2_data_48.x = temp_r31->unk8.y;
    Hu3DShadowPosSet(&lbl_2_data_30, &lbl_2_data_3C, &lbl_2_data_48);
}

void fn_2_3F28(OMOBJ *object);

