mariopartyrd/marioparty4/src/REL/m401Dll/main.c
s32 lbl_2_data_158[][10] = {
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x2A),
    DATA_MAKE_NUM(DATADIR_M401, 0x31),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x2B),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x17),
    DATA_MAKE_NUM(DATADIR_M401, 0x39),
    DATA_MAKE_NUM(DATADIR_M401, 0x41),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x22),
    DATA_MAKE_NUM(DATADIR_M401, 0x49),
    DATA_MAKE_NUM(DATADIR_LUIGIMOT, 0x2A),
    DATA_MAKE_NUM(DATADIR_M401, 0x32),
    DATA_MAKE_NUM(DATADIR_LUIGIMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_LUIGIMOT, 0x2B),
    DATA_MAKE_NUM(DATADIR_LUIGIMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_LUIGIMOT, 0x17),
    DATA_MAKE_NUM(DATADIR_M401, 0x3A),
    DATA_MAKE_NUM(DATADIR_M401, 0x42),
    DATA_MAKE_NUM(DATADIR_LUIGIMOT, 0x22),
    DATA_MAKE_NUM(DATADIR_M401, 0x4A),
    DATA_MAKE_NUM(DATADIR_PEACHMOT, 0x2A),
    DATA_MAKE_NUM(DATADIR_M401, 0x33),
    DATA_MAKE_NUM(DATADIR_PEACHMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_PEACHMOT, 0x2B),
    DATA_MAKE_NUM(DATADIR_PEACHMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_PEACHMOT, 0x17),
    DATA_MAKE_NUM(DATADIR_M401, 0x3B),
    DATA_MAKE_NUM(DATADIR_M401, 0x43),
    DATA_MAKE_NUM(DATADIR_PEACHMOT, 0x22),
    DATA_MAKE_NUM(DATADIR_M401, 0x4B),
    DATA_MAKE_NUM(DATADIR_YOSHIMOT, 0x2A),
    DATA_MAKE_NUM(DATADIR_M401, 0x34),
    DATA_MAKE_NUM(DATADIR_YOSHIMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_YOSHIMOT, 0x2B),
    DATA_MAKE_NUM(DATADIR_YOSHIMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_YOSHIMOT, 0x17),
    DATA_MAKE_NUM(DATADIR_M401, 0x3C),
    DATA_MAKE_NUM(DATADIR_M401, 0x44),
    DATA_MAKE_NUM(DATADIR_YOSHIMOT, 0x22),
    DATA_MAKE_NUM(DATADIR_M401, 0x4C),
    DATA_MAKE_NUM(DATADIR_WARIOMOT, 0x2A),
    DATA_MAKE_NUM(DATADIR_M401, 0x35),
    DATA_MAKE_NUM(DATADIR_WARIOMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_WARIOMOT, 0x2B),
    DATA_MAKE_NUM(DATADIR_WARIOMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_WARIOMOT, 0x17),
    DATA_MAKE_NUM(DATADIR_M401, 0x3D),
    DATA_MAKE_NUM(DATADIR_M401, 0x45),
    DATA_MAKE_NUM(DATADIR_WARIOMOT, 0x22),
    DATA_MAKE_NUM(DATADIR_M401, 0x4D),
    DATA_MAKE_NUM(DATADIR_DONKEYMOT, 0x2A),
    DATA_MAKE_NUM(DATADIR_M401, 0x36),
    DATA_MAKE_NUM(DATADIR_DONKEYMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_DONKEYMOT, 0x2B),
    DATA_MAKE_NUM(DATADIR_DONKEYMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_DONKEYMOT, 0x17),
    DATA_MAKE_NUM(DATADIR_M401, 0x3E),
    DATA_MAKE_NUM(DATADIR_M401, 0x46),
    DATA_MAKE_NUM(DATADIR_DONKEYMOT, 0x22),
    DATA_MAKE_NUM(DATADIR_M401, 0x4E),
    DATA_MAKE_NUM(DATADIR_DAISYMOT, 0x2A),
    DATA_MAKE_NUM(DATADIR_M401, 0x37),
    DATA_MAKE_NUM(DATADIR_DAISYMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_DAISYMOT, 0x2B),
    DATA_MAKE_NUM(DATADIR_DAISYMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_DAISYMOT, 0x17),
    DATA_MAKE_NUM(DATADIR_M401, 0x3F),
    DATA_MAKE_NUM(DATADIR_M401, 0x47),
    DATA_MAKE_NUM(DATADIR_DAISYMOT, 0x22),
    DATA_MAKE_NUM(DATADIR_M401, 0x4F),
    DATA_MAKE_NUM(DATADIR_WALUIGIMOT, 0x2A),
    DATA_MAKE_NUM(DATADIR_M401, 0x38),
    DATA_MAKE_NUM(DATADIR_WALUIGIMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_WALUIGIMOT, 0x2B),
    DATA_MAKE_NUM(DATADIR_WALUIGIMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_WALUIGIMOT, 0x17),
    DATA_MAKE_NUM(DATADIR_M401, 0x40),
    DATA_MAKE_NUM(DATADIR_M401, 0x48),
    DATA_MAKE_NUM(DATADIR_WALUIGIMOT, 0x22),
    DATA_MAKE_NUM(DATADIR_M401, 0x50),
};

Vec lbl_2_data_298[] = {
    -150,
    1250,
    -1400,
    -50,
    1250,
    -1400,
    50,
    1250,
    -1400,
    150,
    1250,
    -1400,
};

Vec lbl_2_data_2C8[] = {
    -300,
    0,
    -1500,
    -100,
    0,
    -1500,
    100,
    0,
    -1500,
    300,
    0,
    -1500,
};

void fn_2_3F28(OMOBJ *object);

void initWorkPlayer(OMOBJ *plrObject)
{
    M401WorkPlayer *plr;
    s32 temp_r29;
    s32 temp_r28;
    s32 temp_r27;
    plrObject->data = HuMemDirectMallocNum(HEAP_HEAP, sizeof(M401WorkPlayer), HU_MEMNUM_OVL);
    plr = plrObject->data;
    temp_r29 = plrObject->work[0];
    plr->unk4 = temp_r29;
    plr->unk8 = GWPlayerCfg[temp_r29].pad_idx;
    temp_r27 = GWPlayerCfg[temp_r29].character;
    plr->unk86 = lbl_2_data_4[temp_r27];
    plrObject->mdlId[0] = CharModelCreate(plr->unk86, 4);
    if (temp_r29 == 0) {
        plrObject->mdlId[2] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x25));
        plrObject->mdlId[3] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x27));
    }
    else {
        plrObject->mdlId[2] = Hu3DModelLink(lbl_2_bss_118[0]->mdlId[2]);
        plrObject->mdlId[3] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x27));
    }
    Hu3DModelAttrSet(plrObject->mdlId[3], HU3D_MOTATTR_PAUSE);
    Hu3DModelClusterAttrSet(plrObject->mdlId[3], 0, 0xC0000002);
    Hu3DModelLayerSet(plrObject->mdlId[3], 7);
    for (temp_r28 = 0; temp_r28 < 10; temp_r28++) {
        plrObject->mtnId[temp_r28] = CharMotionCreate(lbl_2_data_4[temp_r27], lbl_2_data_158[temp_r27][temp_r28]);
    }
    CharMotionSet(plr->unk86, plrObject->mtnId[2]);
    Hu3DModelAttrSet(plrObject->mdlId[0], HU3D_MOTATTR_LOOP);
    Hu3DModelAttrSet(plrObject->mdlId[2], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(plrObject->mdlId[2], HU3D_MOTATTR_LOOP);
    Hu3DModelLayerSet(plrObject->mdlId[2], 2);
    Hu3DModelAmbSet(plrObject->mdlId[0], 1, 1, 1);
    Hu3DModelShadowSet(plrObject->mdlId[0]);
    CharMotionVoiceOnSet(lbl_2_data_4[temp_r27], plrObject->mtnId[4], 0);
    plr->unkC = lbl_2_data_2C8[temp_r29];
    plr->unk58.z = 0;
    omSetTra(plrObject, lbl_2_data_298[temp_r29].x, lbl_2_data_298[temp_r29].y, lbl_2_data_298[temp_r29].z);
    plr->unk0 = 0;
    plr->unk6E = 70;
    plr->unk24.x = lbl_2_data_2C8[temp_r29].x;
    plr->unk24.y = lbl_2_data_2C8[temp_r29].y;
    plr->unk24.z = 800 + lbl_2_data_2C8[temp_r29].z;
    plr->unk6A = 0;
    plr->coinCnt = 0;
    plr->unk74 = 0;
    plr->unk78 = 0;
    plr->unk7A = 0;
    plr->unk7C = 0;
    plr->unk76 = 0;
    plr->unk88 = 0;
    plr->unk84 = 0;
    plr->unk8C = 0;
    plr->unk8E = 0;
    plr->unk94.x = plr->unk94.y = plr->unk94.z = 0;
    plr->unk90 = 0;
    plr->unkA0 = plr->unkA1 = 0;
    CharMotionDataClose(plr->unk86);
    plrObject->objFunc = fn_2_3F28;
}

void fn_2_6B44(OMOBJ *object);
void fn_2_D3E8(OMOBJ *object);

void fn_2_3F28(OMOBJ *object)
{
    Vec sp28;
    Vec sp1C;
    Vec sp10;
    M401WorkPlayer *temp_r31;
    HU3DCAMERA *temp_r29;
    OMOBJ *temp_r28;
    UnkWork10A88 *temp_r27;
    float temp_f27;
    temp_r31 = object->data;
    switch (temp_r31->unk0) {
        case 0:
            if (--temp_r31->unk6E == 0) {
                temp_r31->unk0 = 1;
                CharMotionShiftSet(temp_r31->unk86, object->mtnId[4], 0, 20, HU3D_MOTATTR_NONE);
                temp_r31->unk58.x = 16;
                temp_r31->unk58.y = 0;
            }
            break;

        case 1:
            if (object->trans.y < 1100) {
                temp_r31->unk0 = 2;
                temp_f27 = VECMagPoint(object->trans.x - temp_r31->unk24.x, object->trans.y - temp_r31->unk24.y, object->trans.z - temp_r31->unk24.z);
                temp_r31->unk58.z = temp_f27;
                temp_r31->unk58.y = 0;
                temp_r31->unk6E = 110;
                temp_r28 = fn_2_10A88(&lbl_2_data_298[temp_r31->unk4], 2);
                temp_r31->unk50 = temp_r28;
                temp_r27 = temp_r28->data;
                temp_r27->unkC = object;
                fn_2_6B44(object);
                temp_r28 = fn_2_10A88(&lbl_2_data_298[temp_r31->unk4], 4);
                temp_r27 = temp_r28->data;
                temp_r27->unkC = object;
                temp_r31->unk4C = temp_r28;
                temp_r28 = fn_2_10A88(&lbl_2_data_298[temp_r31->unk4], 5);
                temp_r27 = temp_r28->data;
                temp_r27->unkC = object;
                temp_r31->unk48 = temp_r28;
                CharMotionShiftSet(temp_r31->unk86, object->mtnId[1], 0, 80, HU3D_MOTATTR_LOOP);
                temp_r31->unk30.x = object->trans.x;
                temp_r31->unk30.y = object->trans.y;
                temp_r31->unk30.z = object->trans.z;
                Hu3DModelAttrReset(object->mdlId[3], HU3D_ATTR_DISPOFF);
                Hu3DModelAttrReset(object->mdlId[3], HU3D_MOTATTR_PAUSE);
                Hu3DModelClusterAttrReset(object->mdlId[3], 0, 0xC0000002);
                Hu3DModelPosSet(object->mdlId[3], object->trans.x, 100, 100 + object->trans.z);
                Hu3DMotionTimeSet(object->mdlId[3], 0);
                if (temp_r31->unk4 == 0) {
                    HuAudFXPlay(1281);
                }
                omVibrate(temp_r31->unk4, 12, 4, 2);
            }
            else {
                object->trans.y += temp_r31->unk58.x - (0.07f * temp_r31->unk58.y * temp_r31->unk58.y);
                object->trans.z += 2.0f;
                temp_r31->unk58.y += 1.0f;
            }
            break;

