mariopartyrd/marioparty4/src/REL/m401Dll/main.c
        case 16:
            if (!temp_r31->unk6C) {
                temp_r31->unk6C = 1;
                PlayerFXPlay(temp_r31->unk4, 292);
                Hu3DMotionOverlaySet(object->mdlId[0], object->mtnId[9]);
                if (temp_r31->unk4 == lbl_2_bss_B2[0]) {
                    HuAudSStreamPlay(1);
                    lbl_2_bss_C0 = MGSeqWinCreate(lbl_2_bss_AA[0], lbl_2_bss_AA[1], lbl_2_bss_AA[2], lbl_2_bss_AA[3]);
                    lbl_2_bss_1A = 210;
                    temp_r31->unk6E = 160;
                    temp_r31->unk0 = 13;
                }
            }
            temp_r31->unk58.x *= 1.17f;
            object->trans.y -= 0.35f * sind(temp_r31->unk80);
            temp_r31->unk80 += 3.0f;
            if (temp_r31->unk80 >= 360.0f) {
                temp_r31->unk80 -= 360.0f;
            }
            if (73.0f <= Hu3DMotionOverlayTimeGet(object->mdlId[0])) {
                Hu3DMotionOverlayTimeSet(object->mdlId[0], 35.0f);
            }
            break;

        case 10:
            object->trans.y += temp_r31->unk58.x;
            if (object->trans.y >= 910.0f) {
                if (temp_r31->unk6C == 0) {
                    temp_r31->unk6C = 1;
                    omVibrate(temp_r31->unk4, 12, 4, 2);
                    Hu3DModelAttrReset(object->mdlId[2], HU3D_ATTR_DISPOFF);
                    Hu3DModelAttrReset(object->mdlId[2], HU3D_MOTATTR_PAUSE);
                    Hu3DModelAttrSet(object->mdlId[2], HU3D_MOTATTR_LOOP);
                    Hu3DModelPosSet(object->mdlId[2], object->trans.x, 950, 30 + object->trans.z);
                    Hu3DModelScaleSet(object->mdlId[2], 1, 1, 1);
                    Hu3DMotionTimeSet(object->mdlId[2], 0);
                    Hu3DModelAttrReset(object->mdlId[3], HU3D_MOTATTR_PAUSE);
                    Hu3DModelAttrReset(object->mdlId[3], HU3D_ATTR_DISPOFF);
                    Hu3DModelClusterAttrReset(object->mdlId[3], 0, 0xC0000002);
                    Hu3DModelPosSet(object->mdlId[3], object->trans.x, 0, 30 + object->trans.z);
                    Hu3DMotionTimeSet(object->mdlId[3], 0);
                    sp4C.x = object->trans.x;
                    sp4C.y = 950;
                    sp4C.z = 30 + object->trans.z;
                    fn_2_10A88(&sp4C, 7);
                    HuAudFXEmiterPlay(1289, &sp4C);
                }
                temp_r31->unk0 = 11;
                temp_r31->unk24.x = sp30[temp_r31->unk4];
                temp_r31->unk24.y = 1030;
                temp_r31->unk24.z = 40;
                sp4C.x = object->trans.x;
                sp4C.y = object->trans.y;
                sp4C.z = object->trans.z;
                VECSubtract(&temp_r31->unk24, &sp4C, &sp40);
                VECNormalize(&sp40, &sp40);
                temp_f29 = VECDistanceXZ(&temp_r31->unk24, &object->trans);
                temp_r31->unk30.x = (sp40.x * temp_f29) / 60.0f;
                temp_r31->unk30.z = (sp40.z * temp_f29) / 60.0f;
                temp_r31->unk30.y = 18.75f;
                temp_r31->unk58.y = 0;
            }
            break;

        case 11:
            temp_f29 = temp_r31->unk30.y - (0.020833334f * temp_r31->unk58.y * temp_r31->unk58.y);
            object->trans.x += temp_r31->unk30.x;
            object->trans.z += temp_r31->unk30.z;
            object->trans.y += temp_f29;
            temp_r31->unk58.y += 1.0f;
            if (object->trans.y <= 1030.0f && temp_f29 < 0) {
                temp_r31->unk0 = 12;
                object->trans.y = 1030 + temp_r29->unk4;
                CharMotionShiftSet(temp_r31->unk86, object->mtnId[2], 0, 15, HU3D_MOTATTR_LOOP);
                temp_r31->unk58.x = 0;
            }
            break;

        case 12:
            object->trans.y = 1030 + temp_r29->unk4;
            sp24.x = (sind(temp_r31->unk58.x), 0.0);
            sp24.y = -100 * sind(temp_r31->unk58.x) + 1300;
            sp24.z = -500 * sind(temp_r31->unk58.x) + 1300;
            sp18.x = (sind(temp_r31->unk58.x), 0.0);
            sp18.y = 330 * sind(temp_r31->unk58.x) + 920;
            sp18.z = (sind(temp_r31->unk58.x), 0.0) + -100.0;
            spC.x = 0;
            spC.y = 1;
            spC.z = 0;
            Hu3DCameraPosSetV(1, &sp24, &spC, &sp18);
            temp_r31->unk58.x += 3.0f;
            if (temp_r31->unk58.x > 90.0f) {
                temp_r31->unk0 = 13;
                CharMotionShiftSet(temp_r31->unk86, object->mtnId[5], 0, 20, HU3D_MOTATTR_NONE);
                HuAudSStreamPlay(1);
                lbl_2_bss_C0 = MGSeqWinCreate(lbl_2_bss_AA[0], -1, -1, -1);
                lbl_2_bss_1A = 210;
            }
            temp_r31->unk6E = 160;
            break;

        case 13:
            if (lbl_2_bss_BA == 1) {
                object->trans.y = 1030 + temp_r29->unk4;
            }
            else {
                temp_r31->unk58.x *= 1.17f;
                object->trans.y -= 0.35f * sind(temp_r31->unk80);
                temp_r31->unk80 += 3.0f;
                if (temp_r31->unk80 >= 360.0f) {
                    temp_r31->unk80 -= 360.0f;
                }
                if (73.0f <= Hu3DMotionOverlayTimeGet(object->mdlId[0])) {
                    Hu3DMotionOverlayTimeSet(object->mdlId[0], 35.0f);
                }
            }
            if (--temp_r31->unk6E == 0) {
                temp_r31->unk0 = 14;
            }

            break;

        case 14:
            if (temp_r31->unk68) {
                if (lbl_2_bss_BA == 1) {
                    object->trans.y = 1030 + temp_r29->unk4;
                }
                else {
                    temp_r31->unk58.x *= 1.17f;
                    object->trans.y -= 0.35f * sind(temp_r31->unk80);
                    temp_r31->unk80 += 3.0f;
                    if (temp_r31->unk80 >= 360.0f) {
                        temp_r31->unk80 -= 360.0f;
                    }
                    if (73.0f <= Hu3DMotionOverlayTimeGet(object->mdlId[0])) {
                        Hu3DMotionOverlayTimeSet(object->mdlId[0], 35.0f);
                    }
                }
            }
            if (lbl_2_bss_1A <= 0) {
                WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
                HuAudSeqFadeOut(lbl_2_bss_A4, 100);
                HuAudFXStop(lbl_2_bss_11C);
                temp_r31->unk0 = 15;
            }
            break;

        case 15:
            if (temp_r31->unk68) {
                if (lbl_2_bss_BA == 1) {
                    object->trans.y = 1030 + temp_r29->unk4;
                }
                else {
                    temp_r31->unk58.x *= 1.17f;
                    object->trans.y -= 0.35f * sind(temp_r31->unk80);
                    temp_r31->unk80 += 3.0f;
                    if (temp_r31->unk80 >= 360.0f) {
                        temp_r31->unk80 -= 360.0f;
                    }
                    if (73.0f <= Hu3DMotionOverlayTimeGet(object->mdlId[0])) {
                        Hu3DMotionOverlayTimeSet(object->mdlId[0], 35.0f);
                    }
                }
            }
            if (!WipeStatGet()) {
                lbl_2_bss_110->objFunc = fn_2_A10;
            }
            break;
    }
}

void fn_2_65FC(OMOBJ *object);
void fn_2_6AF4(OMOBJ *object);
void fn_2_A940(OMOBJ *object);

