mariopartyrd/marioparty4/src/REL/m401Dll/main.c
void fn_2_6AF4(OMOBJ *object)
{
    M401WorkPlayer *temp_r31 = object->data;
    temp_r31->unk18.x = temp_r31->unkC.x + lbl_2_bss_60.x;
    temp_r31->unk18.y = object->trans.y;
    temp_r31->unk18.z = 80 + object->trans.z;
}

void fn_2_6B44(OMOBJ *object)
{
    M401WorkPlayer *temp_r30;
    float temp_f31;
    float temp_f30;
    float temp_f29;
    temp_r30 = object->data;
    temp_f31 = 80.0 * sind(object->rot.y + 180.0f);
    temp_f29 = 80.0 * -cosd(object->rot.y);
    temp_f30 = 80.0 * sind(object->rot.x);
    temp_r30->unk18.x = object->trans.x + temp_f31;
    temp_r30->unk18.y = object->trans.y + temp_f30;
    temp_r30->unk18.z = object->trans.z + temp_f29;
}

OMOBJ *fn_2_792C(OMOBJ *object);

void fn_2_6C94(OMOBJ *object, s8 *x, s8 *y, u16 *btn)
{
    M401WorkPlayer *temp_r31;
    s32 temp_r30;
    OMOBJ *temp_r28;
    s32 temp_r27;
    u16 temp_r26 = 0;
    float temp_f31;
    float temp_f30;
    float temp_f29;
    s16 sp50[][8] = {
        0,
        2,
        0,
        2,
        0,
        2,
        0,
        2,
        0,
        2,
        0,
        2,
        0,
        0,
        0,
        2,
        0,
        0,
        0,
        2,
        0,
        0,
        0,
        2,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
    };
    Vec sp44;
    Vec sp38;
    Vec sp2C;
    Vec sp20;
    s16 sp18[] = { 50, 125, 200, 245 };
    s16 sp10[] = { 75, 150, 200, 250 };
    s16 sp8[] = { 9, 6, 4, 2 };
    temp_r31 = object->data;
    *x = *y = 0;
    *btn = 0;
    if (temp_r31->unk7C == 0) {
        temp_r31->unk7E = sp50[GWPlayerCfg[temp_r31->unk4].diff][frand() & 0x7];
        temp_r31->unk7C = (frand() % 60) + 30;
        temp_r31->unk92 = 0;
        if (frandu8() < sp18[GWPlayerCfg[temp_r31->unk4].diff]) {
            temp_r31->unk92 |= 1;
        }
        if (frandu8() < sp10[GWPlayerCfg[temp_r31->unk4].diff]) {
            temp_r31->unk92 |= 2;
        }
    }
    else {
        temp_r31->unk7C--;
    }
    temp_r26 = temp_r31->unk92;
    sp44.x = sp44.y = sp44.z = 0;
    switch (temp_r31->unk7E) {
        case 0:
            temp_r28 = fn_2_792C(object);
            if (temp_r28) {
                sp44.x = temp_r28->trans.x - object->trans.x;
                sp44.y = temp_r28->trans.y - object->trans.y;
                sp44.z = temp_r28->trans.z - object->trans.z;
            }
            break;

        case 2:
            break;
    }
    if (temp_r26 & 0x1) {
        sp38.x = object->trans.x;
        sp38.y = object->trans.y;
        sp38.z = object->trans.z;
        for (temp_r27 = 0; temp_r27 < 4; temp_r27++) {
            if (lbl_2_bss_118[temp_r27] != object) {
                sp20.x = lbl_2_bss_118[temp_r27]->trans.x;
                sp20.y = lbl_2_bss_118[temp_r27]->trans.y;
                sp20.z = lbl_2_bss_118[temp_r27]->trans.z;
                VECSubtract(&sp38, &sp20, &sp2C);
                temp_f31 = VECMag(&sp2C) - 110.0f;
                if (temp_f31 < 110.0f) {
                    temp_f31 -= 60.0f;
                    if (temp_f31 < 0.01f) {
                        temp_f31 = 0.01;
                    }
                    VECScale(&sp2C, &sp2C, 1.0f / temp_f31);
                    VECAdd(&sp44, &sp2C, &sp44);
                }
            }
        }
    }
    if (temp_r26 & 0x2) {
        for (temp_r30 = 0; temp_r30 < 4; temp_r30++) {
            if (lbl_2_bss_E4[temp_r30]->objFunc != NULL) {
                sp20.x = lbl_2_bss_E4[temp_r30]->trans.x;
                sp20.y = lbl_2_bss_E4[temp_r30]->trans.y;
                sp20.z = lbl_2_bss_E4[temp_r30]->trans.z;
                VECSubtract(&sp38, &sp20, &sp2C);
                temp_f31 = VECMag(&sp2C) - 110.0f;
                if (temp_f31 < 110.0f) {
                    temp_f31 -= 60.0f;
                    if (temp_f31 < 0.01f) {
                        temp_f31 = 0.01;
                    }
                    VECScale(&sp2C, &sp2C, 1.0f / temp_f31);
                    VECAdd(&sp44, &sp2C, &sp44);
                }
            }
        }
        for (temp_r30 = 0; temp_r30 < 2; temp_r30++) {
            if (lbl_2_bss_100[temp_r30]->objFunc != NULL) {
                sp20.x = lbl_2_bss_100[temp_r30]->trans.x;
                sp20.y = lbl_2_bss_100[temp_r30]->trans.y;
                sp20.z = lbl_2_bss_100[temp_r30]->trans.z;
                VECSubtract(&sp38, &sp20, &sp2C);
                temp_f31 = VECMag(&sp2C) - 110.0f;
                if (temp_f31 < 110.0f) {
                    temp_f31 -= 60.0f;
                    if (temp_f31 < 0.01f) {
                        temp_f31 = 0.01;
                    }
                    VECScale(&sp2C, &sp2C, 1.0f / temp_f31);
                    VECAdd(&sp44, &sp2C, &sp44);
                }
            }
        }
        sp20.x = lbl_2_bss_FC->trans.x;
        sp20.y = lbl_2_bss_FC->trans.y;
        sp20.z = lbl_2_bss_FC->trans.z;
        VECSubtract(&sp38, &sp20, &sp2C);
        sp2C.x = 0;
        temp_f31 = VECMag(&sp2C) - 220.0f;
        if (temp_f31 < 220.0f) {
            temp_f31 -= 160.0f;
            if (temp_f31 < 0.01f) {
                temp_f31 = 0.01;
            }
            VECScale(&sp2C, &sp2C, 1.0f / temp_f31);
            VECAdd(&sp44, &sp2C, &sp44);
        }
    }

    if (sp44.z < 0.0f) {
        if (temp_r31->unk90 == 0) {
            *btn |= 0x100;
            temp_r31->unk90 = (frand() % sp8[GWPlayerCfg[temp_r31->unk4].diff]) + 3;
        }
        else {
            temp_r31->unk90--;
        }
    }
    sp44.z = 0;
    temp_f30 = VECMag(&sp44);
    temp_f30 *= 0.2f;
    temp_f29 = atan2d(sp44.y, sp44.x);
    if (temp_f30 > 72.0f) {
        temp_f30 = 72.0f;
    }
    if (temp_f30 < 10.0f) {
        temp_f30 = 0.0f;
    }
    *x = temp_f30 * cosd(temp_f29);
    *y = temp_f30 * sind(temp_f29);
}

s32 fn_2_AC2C(Vec *pos, float dist, OMOBJ **newobj);

s32 fn_2_7640(OMOBJ *object, OMOBJ **newobj)
{
    Vec spC;
    spC.x = object->trans.x;
    spC.y = object->trans.y;
    spC.z = object->trans.z - 100.0f;
    return fn_2_AC2C(&spC, 270.0f, newobj);
}

void fn_2_76AC(OMOBJ *object, s32 arg1)
{
    M401WorkPlayer *temp_r31;
    if (arg1) {
        temp_r31 = object->data;
        temp_r31->unk7E = 1;
        temp_r31->unk7C = 5;
        switch (arg1) {
            case 1:
                temp_r31->unk80 = 180.0 + atan2d(temp_r31->unk54->trans.x - object->trans.x, temp_r31->unk54->trans.y - object->trans.y);
                break;

