mariopartyrd/marioparty4/src/REL/m401Dll/main.c
            case 2:
                if (temp_r31->unkC.y > temp_r31->unk54->trans.y) {
                    temp_r31->unk80 = 80.0f + ((1.0f / 255.0f) * (20.0f * frandu8()));
                }
                else {
                    temp_r31->unk80 = 260.0f + ((1.0f / 255.0f) * (20.0f * frandu8()));
                }
                break;

            case 3:
                if (temp_r31->unkC.y > temp_r31->unk54->trans.y) {
                    temp_r31->unk80 = 80.0f + ((1.0f / 255.0f) * (20.0f * frandu8()));
                }
                else {
                    temp_r31->unk80 = 260.0f + ((1.0f / 255.0f) * (20.0f * frandu8()));
                }
                break;
        }
    }
}

OMOBJ *fn_2_792C(OMOBJ *object)
{
    OMOBJ **temp_r31;
    s32 temp_r30;
    OMOBJ *temp_r28;
    float temp_f31, temp_f30, temp_f29;
    float temp_f27, temp_f26;
    temp_r31 = omGetGroupMemberListEx(HuPrcCurrentGet(), 1);
    temp_f26 = 100000;
    temp_r28 = NULL;
    for (temp_r30 = 0; temp_r30 < 28; temp_r30++) {
        if (temp_r31[temp_r30] == NULL || temp_r31[temp_r30]->trans.z - lbl_2_bss_60.z > 850.0f
            || temp_r31[temp_r30]->trans.z - lbl_2_bss_60.z < -2500.0f) {
            continue;
        }
        temp_f30 = temp_r31[temp_r30]->trans.x - object->trans.x;
        temp_f29 = temp_r31[temp_r30]->trans.y - object->trans.y;
        temp_f31 = temp_r31[temp_r30]->trans.z - object->trans.z;
        temp_f31 *= 0.15f;
        temp_f27 = VECMagPoint(temp_f30, temp_f29, temp_f31);
        if (temp_f27 < temp_f26 && temp_f27 < 2000.0f) {
            temp_f26 = temp_f27;
            temp_r28 = temp_r31[temp_r30];
        }
    }
    return temp_r28;
}

void fn_2_A914(s32 player);

void fn_2_7C3C(OMOBJ *object)
{
    M401WorkPlayer *temp_r31 = object->data;
    temp_r31->unk78 = 1;
    temp_r31->unk7A = 120;
    CharMotionShiftSet(temp_r31->unk86, object->mtnId[7], 0, 10, HU3D_MOTATTR_NONE);
    fn_2_A914(temp_r31->unk4);
}

typedef struct work_7CB4 {
    s16 unk0;
    Vec unk4;
    Vec unk10;
    s16 unk1C;
    s16 unk1E;
    s16 unk20;
    s16 unk22;
    s16 unk24;
    float unk28;
    s16 unk2C;
    s16 unk2E;
    float unk30;
} Work7CB4;

void fn_2_7E6C(OMOBJ *object);

void fn_2_7CB4(OMOBJ *object)
{
    Work7CB4 *temp_r31;
    object->data = HuMemDirectMallocNum(HEAP_HEAP, sizeof(Work7CB4), HU_MEMNUM_OVL);
    temp_r31 = object->data;
    temp_r31->unk10.x = 0;
    temp_r31->unk10.y = 200;
    temp_r31->unk10.z = 0;
    temp_r31->unk1E = 0;
    temp_r31->unk22 = 100;
    temp_r31->unk4.x = 0;
    temp_r31->unk4.y = 200;
    temp_r31->unk24 = 0;
    temp_r31->unk28 = 0;
    object->mdlId[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x0B));
    Hu3DModelClusterAttrSet(object->mdlId[0], 0, 0xC0000001);
    Hu3DModelAttrSet(object->mdlId[0], HU3D_ATTR_DISPOFF);
    Hu3DModelAmbSet(object->mdlId[0], 0.6f, 0.6f, 0.6f);
    Hu3DModelShadowSet(object->mdlId[0]);
    temp_r31->unk0 = 0;
    temp_r31->unk22 = 180;
    omSetTra(object, 0, 200, 200);
    omSetRot(object, 0, 180, 0);
    object->objFunc = fn_2_7E6C;
}

void fn_2_7E6C(OMOBJ *object)
{
    Work7CB4 *temp_r31;
    temp_r31 = object->data;
    switch (temp_r31->unk0) {
        case 0:
            if (--temp_r31->unk22 == 0) {
                temp_r31->unk0 = 1;
            }
            break;

        case 1:
            object->trans.z += -11.333333f;
            break;
    }
}

s32 gap_04_00000328_data = DATA_MAKE_NUM(DATADIR_M401, 0x0C);
s32 lbl_2_data_32C[] = { 4, 6 };
Vec lbl_2_data_334[][10] = { {
                                 { 1400, -600, -21500 },
                                 { -100, 100, -22000 },
                                 { -1000, -200, -23000 },
                                 { -2000, -200, -23500 },
                                 { -2200, -200, -23500 },
                                 { -2300, -200, -23500 },
                             },
    {
        { -1000, 500, -29500 },
        { -300, 300, -31500 },
        { 300, -150, -32500 },
        { -200, 250, -34000 },
        { -300, 300, -35000 },
        { -600, 300, -36000 },
        { 1000, -180, -40000 },
        { 1000, -180, -40000 },
    }

};

void fn_2_7EDC(s32 arg0, s32 arg1, float arg2, Vec *arg3)
{
    Vec *temp_r31;
    Vec *temp_r30;
    Vec *temp_r29;
    Vec *temp_r28;
    float temp_f31 = arg2 * arg2;
    if (arg1 == 0) {
        temp_r31 = &lbl_2_data_334[arg0][arg1];
        temp_r30 = &lbl_2_data_334[arg0][arg1 + 1];
        temp_r29 = &lbl_2_data_334[arg0][arg1 + 2];
        temp_r28 = &lbl_2_data_334[arg0][arg1 + 3];
        arg3->x = (0.5f
            * ((2.0f * temp_r31->x)
                + ((temp_f31 * (temp_r29->x + (temp_r31->x - (2.0f * temp_r30->x))))
                    + (arg2 * (((-3.0f * temp_r31->x) + (4.0f * temp_r30->x)) - temp_r29->x)))));
        arg3->y = (0.5f
            * ((2.0f * temp_r31->y)
                + ((temp_f31 * (temp_r29->y + (temp_r31->y - (2.0f * temp_r30->y))))
                    + (arg2 * (((-3.0f * temp_r31->y) + (4.0f * temp_r30->y)) - temp_r29->y)))));
        arg3->z = (0.5f
            * ((2.0f * temp_r31->z)
                + ((temp_f31 * (temp_r29->z + (temp_r31->z - (2.0f * temp_r30->z))))
                    + (arg2 * (((-3.0f * temp_r31->z) + (4.0f * temp_r30->z)) - temp_r29->z)))));
    }
    else {
        temp_r31 = &lbl_2_data_334[arg0][arg1 - 1];
        temp_r30 = &lbl_2_data_334[arg0][arg1];
        temp_r29 = &lbl_2_data_334[arg0][arg1 + 1];
        temp_r28 = &lbl_2_data_334[arg0][arg1 + 2];
        arg3->x = (0.5f
            * ((2.0f * temp_r30->x)
                + ((arg2 * (-temp_r31->x + temp_r29->x))
                    + ((arg2 * (temp_f31 * (temp_r28->x + ((-temp_r31->x + (3.0f * temp_r30->x)) - (3.0f * temp_r29->x)))))
                        + (temp_f31 * (((4.0f * temp_r29->x) + ((2.0f * temp_r31->x) - (5.0f * temp_r30->x))) - temp_r28->x))))));
        arg3->y = (0.5f
            * ((2.0f * temp_r30->y)
                + ((arg2 * (-temp_r31->y + temp_r29->y))
                    + ((arg2 * (temp_f31 * (temp_r28->y + ((-temp_r31->y + (3.0f * temp_r30->y)) - (3.0f * temp_r29->y)))))
                        + (temp_f31 * (((4.0f * temp_r29->y) + ((2.0f * temp_r31->y) - (5.0f * temp_r30->y))) - temp_r28->y))))));
        arg3->z = (0.5f
            * ((2.0f * temp_r30->z)
                + ((arg2 * (-temp_r31->z + temp_r29->z))
                    + ((arg2 * (temp_f31 * (temp_r28->z + ((-temp_r31->z + (3.0f * temp_r30->z)) - (3.0f * temp_r29->z)))))
                        + (temp_f31 * (((4.0f * temp_r29->z) + ((2.0f * temp_r31->z) - (5.0f * temp_r30->z))) - temp_r28->z))))));
    }
}

