mariopartyrd/marioparty4/src/REL/m401Dll/main.c
void fn_2_95E4(OMOBJ *object)
{
    object->mdlId[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x18));
    object->mtnId[0] = Hu3DJointMotionFile(object->mdlId[0], DATA_MAKE_NUM(DATADIR_M401, 0x19));
    object->mtnId[1] = Hu3DJointMotionFile(object->mdlId[0], DATA_MAKE_NUM(DATADIR_M401, 0x1A));
    omSetTra(object, 3000, 0, -37000);
    omSetRot(object, 0, 270, 0);
    Hu3DMotionSet(object->mdlId[0], object->mtnId[0]);
    Hu3DModelAttrSet(object->mdlId[0], HU3D_ATTR_DISPOFF);
    Hu3DModelAttrSet(object->mdlId[0], HU3D_MOTATTR_LOOP);
    object->work[3] = 3;
    Hu3DModelShadowSet(object->mdlId[0]);
    object->objFunc = fn_2_979C;
}

void fn_2_9734(s32 flag)
{
    if (flag) {
        Hu3DModelAttrReset(lbl_2_bss_FC->mdlId[0], HU3D_ATTR_DISPOFF);
    }
    else {
        Hu3DModelAttrSet(lbl_2_bss_FC->mdlId[0], HU3D_ATTR_DISPOFF);
    }
}

void fn_2_988C(OMOBJ *object);

void fn_2_979C(OMOBJ *object)
{
    if (lbl_2_bss_60.z < -19000.0f) {
        fn_2_9734(1);
        omSetTra(object, -2500, -800, -21000);
        omSetRot(object, 0, 125, 0);
        Hu3DMotionSet(object->mdlId[0], object->mtnId[0]);
        Hu3DModelAttrSet(object->mdlId[0], HU3D_MOTATTR_LOOP);
        object->objFunc = fn_2_988C;
    }
}

void fn_2_99A4(OMOBJ *object);

void fn_2_988C(OMOBJ *object)
{
    object->trans.x += 2.3f * (26.0 * sind(object->rot.y));
    object->trans.z += 2.3f * (26.0 * cosd(object->rot.y));
    if (object->trans.x > 6000.0f) {
        fn_2_9734(0);
        object->objFunc = fn_2_99A4;
    }
}

void fn_2_9B90(OMOBJ *object);

void fn_2_99A4(OMOBJ *object)
{
    float temp_f31;
    if (lbl_2_bss_60.z <= -36200.0f + ((1.0f / 255.0f) * (200.0f * frandu8()))) {
        temp_f31 = -250.0f + ((1.0f / 255.0f) * (500.0f * frandu8()));
        fn_2_9734(1);
        omSetTra(object, 3000, temp_f31, -37000);
        omSetRot(object, 0, 270, 0);
        Hu3DMotionSet(object->mdlId[0], object->mtnId[0]);
        Hu3DModelAttrSet(object->mdlId[0], HU3D_MOTATTR_LOOP);
        object->objFunc = fn_2_9B90;
        lbl_2_bss_78.x = object->trans.x;
        lbl_2_bss_78.y = object->trans.y;
        lbl_2_bss_78.z = object->trans.z;
        lbl_2_bss_8C = HuAudFXEmiterPlay(1286, &lbl_2_bss_78);
    }
}

void fn_2_9B90(OMOBJ *object)
{
    object->trans.x += 2.3f * (17.0 * sind(object->rot.y));
    object->trans.z += 2.3f * (17.0 * cosd(object->rot.y));
    lbl_2_bss_78.x = object->trans.x;
    lbl_2_bss_78.y = object->trans.y;
    lbl_2_bss_78.z = object->trans.z;
    HuAudFXEmiterUpDate(lbl_2_bss_8C, &lbl_2_bss_78);
    if (object->trans.x <= -3000.0f) {
        fn_2_9734(0);
        object->objFunc = NULL;
        HuAudFXStop(lbl_2_bss_8C);
    }
}

typedef struct work_a318 {
    Vec unk0;
    s16 unkC;
} WorkA318;

s32 lbl_2_data_42C[] = { DATA_MAKE_NUM(DATADIR_M401, 0x1C), DATA_MAKE_NUM(DATADIR_M401, 0x1D) };

void fn_2_9D00(HUPROCESS *objman)
{
    OMOBJ *temp_r31;
    s32 temp_r30;
    s32 temp_r29;
    for (temp_r29 = 0; temp_r29 < 4; temp_r29++) {
        temp_r31 = omAddObjEx(objman, 1130, 1, 2, -1, NULL);
        lbl_2_bss_E4[temp_r29] = temp_r31;
        temp_r31->mdlId[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x1B));
        for (temp_r30 = 0; temp_r30 < 2; temp_r30++) {
            temp_r31->mtnId[temp_r30] = Hu3DJointMotionFile(temp_r31->mdlId[0], lbl_2_data_42C[temp_r30]);
        }
        Hu3DModelAttrSet(temp_r31->mdlId[0], HU3D_ATTR_DISPOFF);
        temp_r31->data = HuMemDirectMallocNum(HEAP_HEAP, sizeof(WorkA318), HU_MEMNUM_OVL);
        Hu3DModelShadowSet(temp_r31->mdlId[0]);
        temp_r31->work[3] = 1;
    }
}

void fn_2_A318(OMOBJ *object);

void fn_2_9E28(float arg1, float arg2)
{
    s32 temp_r31;
    WorkA318 *temp_r30;
    float temp_f31;
    float temp_f30;
    float temp_f29;
    temp_f30 = (arg2 - arg1) / 4;
    temp_f31 = arg1;
    for (temp_r31 = 0; temp_r31 < 4; temp_r31++) {
        temp_r30 = lbl_2_bss_E4[temp_r31]->data;
        Hu3DModelAttrReset(lbl_2_bss_E4[temp_r31]->mdlId[0], HU3D_ATTR_DISPOFF);
        temp_f29 = -400.0f + ((1.0f / 255.0f) * (800.0f * frandu8()));
        temp_r30->unk0.x = -250.0f + ((1.0f / 255.0f) * (500.0f * frandu8()));
        omSetTra(lbl_2_bss_E4[temp_r31], temp_f29, temp_r30->unk0.x + lbl_2_bss_60.y, temp_f31);
        Hu3DMotionSet(lbl_2_bss_E4[temp_r31]->mdlId[0], lbl_2_bss_E4[temp_r31]->mtnId[0]);
        Hu3DModelAttrSet(lbl_2_bss_E4[temp_r31]->mdlId[0], HU3D_MOTATTR_LOOP);
        temp_f31 += temp_f30;
        temp_r30->unkC = (frand() % 30) + 30;
        temp_r30->unk0.z = 0;
        lbl_2_bss_E4[temp_r31]->objFunc = fn_2_A318;
    }
}

OMOBJ *fn_2_A0B0(OMOBJ *object)
{
    OMOBJ *temp_r31;
    s32 temp_r30;
    OMOBJ *temp_r29;
    M401WorkPlayer *spC;

    float temp_f27;
    float temp_f26;
    temp_f26 = 999999;
    for (temp_r30 = 0; temp_r30 < 4; temp_r30++) {
        float temp_f31;
        float temp_f30;
        float temp_f29;
        temp_r31 = lbl_2_bss_118[temp_r30];
        spC = temp_r31->data;
        temp_f31 = temp_r31->trans.x - object->trans.x;
        temp_f30 = temp_r31->trans.y - object->trans.y;
        temp_f29 = 0.4f * (temp_r31->trans.z - object->trans.z);
        temp_f27 = VECMagPoint(temp_f31, temp_f30, temp_f29);
        if (temp_f27 < temp_f26) {
            temp_r29 = lbl_2_bss_118[temp_r30];
            temp_f26 = temp_f27;
        }
    }
    return temp_r29;
}

void fn_2_A318(OMOBJ *object)
{
    WorkA318 *temp_r30;
    OMOBJ *temp_r28;
    M401WorkPlayer *sp10;
    temp_r30 = object->data;
    if (0.0f == temp_r30->unk0.z) {
        if (temp_r30->unkC == 0) {
            temp_r28 = fn_2_A0B0(object);
            sp10 = temp_r28->data;
            temp_r30->unk0.y = atan2d(temp_r28->trans.y - object->trans.y, temp_r28->trans.x - object->trans.x);
            temp_r30->unk0.z = 8.0f + ((1.0f / 255.0f) * ((9.0f * frandu8())));
            Hu3DMotionSet(object->mdlId[0], object->mtnId[1]);
            Hu3DModelAttrReset(object->mdlId[0], HU3D_MOTATTR_LOOP);
            lbl_2_bss_78.x = object->trans.x;
            lbl_2_bss_78.y = object->trans.y;
            lbl_2_bss_78.z = object->trans.z;
            HuAudFXEmiterPlay(1282, &lbl_2_bss_78);
        }
        else {
            temp_r30->unkC--;
            temp_r30->unk0.x -= 2.5f;
        }
    }
    else {
        temp_r30->unk0.x = temp_r30->unk0.x + (temp_r30->unk0.z * sind(temp_r30->unk0.y));
        object->trans.x += temp_r30->unk0.z * cosd(temp_r30->unk0.y);
        temp_r30->unk0.z *= 0.94f;
        if (temp_r30->unk0.z < 0.1f) {
            temp_r30->unk0.z = 0;
            temp_r30->unkC = (frand() % 30) + 25;
            Hu3DMotionSet(object->mdlId[0], object->mtnId[0]);
            Hu3DModelAttrSet(object->mdlId[0], HU3D_MOTATTR_LOOP);
        }
    }
    if (temp_r30->unk0.x < -300.0f) {
        temp_r30->unk0.x = -300.0f;
    }
    if (temp_r30->unk0.x > 300.0f) {
        temp_r30->unk0.x = 300.0f;
    }
    if (object->trans.x < -400.0f) {
        object->trans.x = -400.0f;
    }
    if (object->trans.x > 400.0f) {
        object->trans.x = 400.0f;
    }
    omSetTra(object, object->trans.x, temp_r30->unk0.x + lbl_2_bss_60.y, object->trans.z);
    if (object->trans.z > lbl_2_bss_6C.z - 160.0f) {
        Hu3DModelAttrSet(object->mdlId[0], HU3D_ATTR_DISPOFF);
        object->objFunc = NULL;
    }
}

void fn_2_A8A4(OMOBJ *object, float x, float y, float z)
{
    omSetTra(object, lbl_2_bss_60.x + x, lbl_2_bss_60.y + y, lbl_2_bss_60.z + z);
}

s32 lbl_2_data_434[] = { 0x12D, 0x16D, 0x1AD, 0x1ED, 0x22D, 0x26D, 0x2AD, 0x2ED };

void fn_2_A914(s32 player)
{
    PlayerFXPlay(player, 301);
}

void fn_2_A940(OMOBJ *object)
{
    Vec spC;
    OMOBJ *sp8;
    M401WorkPlayer *temp_r28;
    s32 temp_r23;
    temp_r28 = object->data;
    if (temp_r28->unk78 != 0) {
        return;
    }
    spC.x = object->trans.x;
    spC.y = object->trans.y;
    spC.z = object->trans.z;
    if ((temp_r23 = fn_2_AC2C(&spC, 90, &sp8)) != 0) {
        if (temp_r23 == 1) {
            omVibrate(temp_r28->unk4, 12, 4, 2);
        }
        else if (temp_r23 == 3) {
            omVibrate(temp_r28->unk4, 12, 4, 2);
        }
        else {
            omVibrate(temp_r28->unk4, 12, 12, 0);
        }
        fn_2_7C3C(object);
        fn_2_1858(temp_r28->unk4, sp8->work[3]);
    }
}

s32 fn_2_AC2C(Vec *pos, float dist, OMOBJ **newobj)
{
    OMOBJ *temp_r30;
    s32 temp_r29;
    float temp_f20;
    float temp_f19;
    float temp_f18;
    WorkA318 *sp70;
    float sp6C;

    *newobj = NULL;
    for (temp_r29 = 0; temp_r29 < 4; temp_r29++) {
        temp_r30 = lbl_2_bss_E4[temp_r29];
        if (temp_r30->objFunc != NULL) {
            sp70 = temp_r30->data;
            temp_f20 = VECMagPoint(pos->x - temp_r30->trans.x, pos->y - temp_r30->trans.y, pos->z - temp_r30->trans.z);
            if (temp_f20 < sqrtf(1024.0f + (dist * dist))) {
                *newobj = temp_r30;
                return 1;
            }
        }
    }
    temp_r30 = lbl_2_bss_FC;
    temp_f20 = VECDistanceZY(pos, &temp_r30->trans);
    if (temp_f20 < sqrtf(6400.0f + (dist * dist)) && temp_r30->trans.x < pos->x - (dist / 2.0f)
        && 1500.0f + temp_r30->trans.x > pos->x + (dist / 2.0f)) {
        *newobj = temp_r30;
        return 2;
    }
    for (temp_r29 = 0; temp_r29 < 2; temp_r29++) {
        if (lbl_2_bss_100[temp_r29]->objFunc != NULL) {
            temp_f19 = lbl_2_bss_100[temp_r29]->trans.x + (70.0 * sind(lbl_2_bss_100[temp_r29]->rot.y));
            temp_f18 = lbl_2_bss_100[temp_r29]->trans.z + (70.0 * cosd(lbl_2_bss_100[temp_r29]->rot.y));
            sp6C = lbl_2_bss_100[temp_r29]->trans.y - 10.0f;
            temp_f20 = VECMagPoint(pos->x - temp_f19, pos->y - sp6C, pos->z - temp_f18);
            if (temp_f20 < sqrtf(4900.0f + (dist * dist))) {
                *newobj = lbl_2_bss_100[temp_r29];
                return 3;
            }
            temp_f19 = lbl_2_bss_100[temp_r29]->trans.x;
            temp_f18 = lbl_2_bss_100[temp_r29]->trans.z;
            sp6C = lbl_2_bss_100[temp_r29]->trans.y - 10.0f;
            temp_f20 = VECMagPoint(pos->x - temp_f19, pos->y - sp6C, pos->z - temp_f18);
            if (temp_f20 < sqrtf(4900.0f + (dist * dist))) {
                *newobj = lbl_2_bss_100[temp_r29];
                return 3;
            }
            temp_f19 = lbl_2_bss_100[temp_r29]->trans.x + (70.0 * sind(lbl_2_bss_100[temp_r29]->rot.y + 180.0f));
            temp_f18 = lbl_2_bss_100[temp_r29]->trans.z + (70.0 * cosd(lbl_2_bss_100[temp_r29]->rot.y + 180.0f));
            sp6C = lbl_2_bss_100[temp_r29]->trans.y - 10.0f;
            temp_f20 = VECMagPoint(pos->x - temp_f19, pos->y - sp6C, pos->z - temp_f18);
            if (temp_f20 < sqrtf(4410.0f + (dist * dist))) {
                *newobj = lbl_2_bss_100[temp_r29];
                return 3;
            }
        }
    }
    return 0;
}

void fn_2_D8CC(OMOBJ *object);

void fn_2_BD90(OMOBJ *object)
{
    s32 temp_r27;
    M401WorkPlayer *temp_r26;
    switch (object->work[0]) {
        case 0:
            WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, 60);
            ;
            object->work[0] = 1;
            break;

        case 1:
            if (!WipeStatGet()) {
                object->work[0] = 2;
                object->work[1] = 180;
            }
            break;

