mariopartyrd/marioparty4/src/REL/m401Dll/main.c
        case 2:
            if (object->work[1] == 0) {
                lbl_2_bss_C0 = MGSeqStartCreate();
                object->work[0] = 3;
                lbl_2_bss_A4 = HuAudSeqPlay(68);
            }
            else {
                object->work[1]--;
            }
            break;

        case 3:
            if (!MGSeqStatGet(lbl_2_bss_C0)) {
                fn_2_AEC(1);
                lbl_2_bss_120 = 1;
                fn_2_1A38(lbl_2_bss_10C);

                lbl_2_bss_10C->objFunc = fn_2_34B8;
                for (temp_r27 = 0; temp_r27 < 4; temp_r27++) {
                    temp_r26 = lbl_2_bss_118[temp_r27]->data;
                    temp_r26->unk58.z = 0;
                    temp_r26->unkC.z = 800;
                    lbl_2_bss_118[temp_r27]->objFunc = fn_2_5CC0;
                    object->trans.x = object->trans.y = object->trans.z = 0;
                }
                lbl_2_bss_108->objFunc = fn_2_8868;
                omDelObjEx(HuPrcCurrentGet(), object);
                lbl_2_bss_114 = NULL;
                lbl_2_bss_4->objFunc = fn_2_D8CC;
            }

            break;
    }
}

void fn_2_C130(OMOBJ *object)
{
    M401WorkPlayer *temp_r31;
    s32 temp_r30;
    HU3DLIGHT *temp_r28;
    Vec sp14;
    Vec sp8;
    switch (object->work[0]) {
        case 0:
            if (!MGSeqStatGet(lbl_2_bss_C0)) {
                object->work[0] = 1;
                #if VERSION_NTSC
                HuAudFXStop(lbl_2_bss_11C);
                #else
                HuAudFXFadeOut(lbl_2_bss_11C, 500);
                #endif
                WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 30);
                WipeColorSet(255, 255, 255);
            }
            break;

        case 1:
            if (WipeStatGet()) {
                return;
            }
            Hu3DFogClear();
            temp_r28 = &Hu3DGlobalLight[0];
            temp_r28->color.r = 255;
            temp_r28->color.g = 255;
            temp_r28->color.b = 255;
            sp14.x = 0;
            sp14.y = 2500;
            sp14.z = 1000;
            sp8.x = 0;
            sp8.y = 1030;
            sp8.z = 0;
            Hu3DGLightPosAimSetV(lbl_2_bss_A8, &sp14, &sp8);
            lbl_2_data_30.x = 0;
            lbl_2_data_30.y = 2500;
            lbl_2_data_30.z = 1000;
            lbl_2_data_48.x = 0;
            lbl_2_data_48.y = 1030;
            lbl_2_data_48.z = 0;
            Hu3DShadowPosSet(&lbl_2_data_30, &lbl_2_data_3C, &lbl_2_data_48);
            HuAudAUXVolSet(-1, -1);
            fn_2_2ED0(lbl_2_bss_10C);
            for (temp_r30 = 0; temp_r30 < 4; temp_r30++) {
                temp_r31 = lbl_2_bss_118[temp_r30]->data;
                temp_r31->unk50->work[0] = 1;
                temp_r31->unk6C = 0;
                CharMotionSet(((M401WorkPlayer *)(lbl_2_bss_118[temp_r30]->data))->unk86, lbl_2_bss_118[temp_r30]->mtnId[4]);
                Hu3DModelAttrReset(lbl_2_bss_118[temp_r30]->mdlId[0], HU3D_MOTATTR_LOOP);
                lbl_2_bss_118[temp_r30]->objFunc = fn_2_48A0;
                Hu3DModelAmbSet(lbl_2_bss_118[temp_r30]->mdlId[0], 0.7f, 0.7f, 0.7f);
                omSetTra(lbl_2_bss_118[temp_r30], -225.0f + (temp_r30 * 150), 740, 400);
                omSetRot(lbl_2_bss_118[temp_r30], 0, 0, 0);
                if (temp_r31->unk68) {
                    if (lbl_2_bss_BA == 1) {
                        temp_r31->unk0 = 10;
                        temp_r31->unk58.x = 13;
                    }
                    else {
                        temp_r31->unk58.x = 10;
                        temp_r31->unk0 = 6;
                    }
                    OSReport("GetCoin:%d\n", temp_r30);
                    GWPlayerCoinWinSet(temp_r30, 10);
                }
                else {
                    temp_r31->unk58.x = 10;
                    temp_r31->unk0 = 6;
                }
            }
            fn_2_26E0(lbl_2_bss_10C);
            object->work[0] = 2;
            lbl_2_bss_F4->work[0] = 1;
            fn_2_141B0();
            lbl_2_bss_10C->objFunc = fn_2_3838;
            lbl_2_bss_11C = HuAudFXPlay(1280);
            WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, 30);
            omDelObjEx(HuPrcCurrentGet(), lbl_2_bss_C8);
            break;

        case 2:
            WipeStatGet() == 0;
            break;
    }
}

typedef struct work_c840 {
    Vec unk0[9];
    float unk6C[9];
} WorkC840;

void fn_2_C840(s16 arg0);

void fn_2_CAB0(OMOBJ *object);

void fn_2_C6DC(OMOBJ *object)
{
    s32 temp_r30;
    float temp_f31;
    WorkC840 *sp8;
    sp8 = object->data = HuMemDirectMallocNum(HEAP_HEAP, sizeof(WorkC840), HU_MEMNUM_OVL);
    for (temp_r30 = 0; temp_r30 < 9; temp_r30++) {
        if (temp_r30 == 0) {
            object->mdlId[temp_r30] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x02));
        }
        else {
            object->mdlId[temp_r30] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x02));
        }
        Hu3DModelLayerSet(object->mdlId[temp_r30], 1);
        fn_2_C840(temp_r30);
        temp_f31 = (1.0f / 255.0f) * (Hu3DMotionMaxTimeGet(object->mdlId[temp_r30]) * frandu8());
        Hu3DMotionTimeSet(object->mdlId[temp_r30], temp_f31);
    }
    omSetStatBit(object, 0x100);
    object->objFunc = fn_2_CAB0;
}

void fn_2_C840(s16 arg0)
{
    WorkC840 *temp_r31;
    float temp_f31, temp_f30;
    temp_r31 = lbl_2_bss_F8->data;
    temp_f30 = (1.0f / 255.0f) * (360.0f * frandu8());
    temp_f31 = (1.0f / 255.0f) * (200.0f * frandu8());
    temp_r31->unk0[arg0].x = temp_f31 * cosd(temp_f30);
    temp_r31->unk0[arg0].z = temp_f31 * sind(temp_f30);
    temp_r31->unk0[arg0].y = 1000;
    temp_r31->unk6C[arg0] = 1.0f;
    temp_f31 *= 0.25f;
    Hu3DModelRotSet(lbl_2_bss_F8->mdlId[arg0], temp_f31 * sind(temp_f30), 0, temp_f31 * cosd(temp_f30));
    Hu3DMotionTimeSet(lbl_2_bss_F8->mdlId[arg0], 0);
}

void fn_2_CAB0(OMOBJ *object)
{
    s32 temp_r31;
    WorkC840 *temp_r29;
    u8 temp_r28;
    float temp_f29;
    temp_r29 = object->data;
    for (temp_r31 = 0; temp_r31 < 9; temp_r31++) {
        Hu3DModelPosSet(
            object->mdlId[temp_r31], temp_r29->unk0[temp_r31].x, temp_r29->unk0[temp_r31].y, lbl_2_bss_38.z + temp_r29->unk0[temp_r31].z - 500);
        Hu3DModelTPLvlSet(object->mdlId[temp_r31], temp_r29->unk6C[temp_r31]);
        temp_f29 = Hu3DMotionTimeGet(object->mdlId[temp_r31]) / Hu3DMotionMaxTimeGet(object->mdlId[temp_r31]);
        temp_r29->unk6C[temp_r31] = 1.0f - temp_f29;
        if (Hu3DMotionTimeGet(object->mdlId[temp_r31]) >= Hu3DMotionMaxTimeGet(object->mdlId[temp_r31])) {
            fn_2_C840(temp_r31);
        }
    }
    if (lbl_2_bss_60.z <= -26800.0f && lbl_2_bss_60.z >= -27400.0f) {
        temp_r28 = 255.0f - (223.0f * (-(lbl_2_bss_60.z + 26800.0f) / 600.0f));
        if (temp_r28 < 32) {
            temp_r28 = 32;
        }
    }
    else if (lbl_2_bss_60.z <= -27700.0f && lbl_2_bss_60.z >= -28300.0f) {
        temp_r28 = 32.0f + (223.0f * (-(lbl_2_bss_60.z + 27700.0f) / 600.0f));
    }
    else if (lbl_2_bss_60.z < -27400.0f && lbl_2_bss_60.z > -28300.0f) {
        temp_r28 = 32;
    }
    else {
        temp_r28 = 255;
    }
    Hu3DGLightColorSet(lbl_2_bss_A8, temp_r28, temp_r28, temp_r28, 255);
    if (lbl_2_bss_60.z < -26600.0f && lbl_2_bss_60.z > -27500.0f) {
        for (temp_r31 = 0; temp_r31 < 9; temp_r31++) {
            Hu3DModelAttrSet(object->mdlId[temp_r31], HU3D_ATTR_DISPOFF);
        }
    }
    else {
        for (temp_r31 = 0; temp_r31 < 9; temp_r31++) {
            Hu3DModelAttrReset(object->mdlId[temp_r31], HU3D_ATTR_DISPOFF);
        }
    }
}

void fn_2_D088(OMOBJ *object)
{
    HU3DCAMERA *temp_r31 = &Hu3DCamera[0];
    Vec sp8;

    lbl_2_bss_6C = temp_r31->pos;
    lbl_2_bss_60 = temp_r31->target;
    VECSubtract(&lbl_2_bss_6C, &lbl_2_bss_54, &sp8);
    lbl_2_bss_50 = VECMag(&sp8);
    lbl_2_bss_54 = lbl_2_bss_6C;

    fn_2_A98();
}

void fn_2_D180(float arg0)
{
    Vec sp14;
    Vec sp8;
    lbl_2_bss_44.x = 0;
    lbl_2_bss_44.y = 0;
    lbl_2_bss_44.z = arg0;
    lbl_2_bss_38.x = 0;
    lbl_2_bss_38.y = 0;
    lbl_2_bss_38.z = -1500 + arg0;
    lbl_2_bss_2C.x = 0;
    lbl_2_bss_2C.y = 1;
    lbl_2_bss_2C.z = 0;
    Hu3DCameraPosSetV(1, &lbl_2_bss_44, &lbl_2_bss_2C, &lbl_2_bss_38);
    Hu3DModelPosSet(lbl_2_bss_10C->mdlId[1], 0, 0, -1500 + arg0);
    lbl_2_data_30.y = 3500 + lbl_2_bss_38.y;
    lbl_2_data_30.z = 1500 + lbl_2_bss_38.z;
    lbl_2_data_48.y = lbl_2_bss_38.y - 200;
    lbl_2_data_48.z = 500 + lbl_2_bss_38.z;
    Hu3DShadowPosSet(&lbl_2_data_30, &lbl_2_data_3C, &lbl_2_data_48);
    sp14 = lbl_2_bss_44;
    VECSubtract(&lbl_2_bss_38, &sp14, &sp8);
    VECNormalize(&sp8, &sp8);
    HuAudFXListnerUpdate(&sp14, &sp8);
}

