mariopartyrd/marioparty4/src/REL/m401Dll/main.c
void fn_2_D3E8(OMOBJ *object)
{
    Vec sp14;
    Vec sp8;
    float temp_f31 = 1.5f * object->scale.x;
    lbl_2_bss_44.x = object->trans.x + (-object->trans.x * sind(temp_f31));
    lbl_2_bss_44.y = object->trans.y + (-object->trans.y * sind(temp_f31));
    lbl_2_bss_44.z = object->trans.z + (-object->trans.z * sind(temp_f31));
    lbl_2_bss_38.x = object->rot.x + (-object->rot.x * sind(temp_f31));
    lbl_2_bss_38.y = object->rot.y + (-object->rot.y * sind(temp_f31));
    lbl_2_bss_38.z = object->rot.z + ((-1500.0f - object->rot.z) * sind(temp_f31));
    lbl_2_bss_2C.x = 0;
    lbl_2_bss_2C.y = 1;
    lbl_2_bss_2C.z = 0;
    object->scale.x += 1.0f;
    if (object->scale.x > 60.0f) {
        lbl_2_bss_44.x = 0;
        lbl_2_bss_44.y = 0;
        lbl_2_bss_44.z = 0;
        lbl_2_bss_38.x = 0;
        lbl_2_bss_38.y = 0;
        lbl_2_bss_38.z = -1500;
    }
    Hu3DCameraPosSetV(1, &lbl_2_bss_44, &lbl_2_bss_2C, &lbl_2_bss_38);
    lbl_2_bss_54 = lbl_2_bss_44;
    lbl_2_data_30.y = 3500 + lbl_2_bss_38.y;
    lbl_2_data_30.z = 1500 + lbl_2_bss_38.z;
    lbl_2_data_48.y = lbl_2_bss_38.y - 200;
    lbl_2_data_48.z = 500 + lbl_2_bss_38.z;
    Hu3DShadowPosSet(&lbl_2_data_30, &lbl_2_data_3C, &lbl_2_data_48);
    sp14 = lbl_2_bss_44;
    VECSubtract(&lbl_2_bss_38, &lbl_2_bss_44, &sp8);
    VECNormalize(&sp8, &sp8);
    HuAudFXListnerUpdate(&sp14, &sp8);
    if (object->scale.x > 60.0f) {
        lbl_2_bss_128 = 100;
        Hu3DCameraPerspectiveSet(1, lbl_2_bss_12C, lbl_2_bss_128, lbl_2_bss_124, 1.2f);
        object->scale.x = 0;
        object->objFunc = NULL;
    }
}

void fn_2_D8CC(OMOBJ *object)
{
    if (lbl_2_bss_BE != 0) {
        return;
    }
    lbl_2_data_0 *= 1.05f;
    if (lbl_2_data_0 < -14.375f) {
        lbl_2_data_0 = -14.375f;
    }
    object->scale.x += lbl_2_data_0;
    fn_2_D180(object->scale.x);
}

s32 lbl_2_data_460[] = { DATA_MAKE_NUM(DATADIR_M401, 0x04), DATA_MAKE_NUM(DATADIR_M401, 0x05), DATA_MAKE_NUM(DATADIR_M401, 0x06) };

typedef struct work_e6e8 {
    s16 unk0;
    Vec unk4;
    float unk10;
    float unk14;
    float unk18;
    float unk1C;
    float unk20;
    float unk24;
    float unk28;
    float unk2C;
    s8 *unk30;
    Vec *unk34;
    Vec *unk38;
    Vec *unk3C;
    Vec *unk40;
    Vec *unk44;
    Vec *unk48;
    Vec *unk4C;
    s16 *unk50;
    s16 *unk54;
    float *unk58;
    float *unk5C;
    float *unk60;
    float *unk64;
    float *unk68;
} WorkE6E8;

void fn_2_DBCC(s16 arg0)
{
    OMOBJ *temp_r31;
    s32 temp_r30;
    s8 *temp_r28;
    float temp_f31;
    temp_r31 = lbl_2_bss_C4 = omAddObjEx(lbl_2_bss_1C, 1145, arg0, 0, -1, NULL);
    omSetStatBit(temp_r31, 0x100);
    temp_r31->data = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(s8), HU_MEMNUM_OVL);
    temp_r28 = temp_r31->data;
    temp_r31->work[0] = arg0;
    for (temp_r30 = 0; temp_r30 < arg0; temp_r30++) {
        if (temp_r30 < 3) {
            temp_r31->mdlId[temp_r30] = Hu3DModelCreateFile(lbl_2_data_460[temp_r30]);
        }
        else {
            temp_r31->mdlId[temp_r30] = Hu3DModelLink(temp_r31->mdlId[temp_r30 % 3]);
        }
        temp_f31 = 0.5f + ((1.0f / 255.0f) * (0.5f * frandu8()));
        Hu3DModelScaleSet(temp_r31->mdlId[temp_r30], temp_f31, temp_f31, temp_f31);
        Hu3DModelAttrSet(temp_r31->mdlId[temp_r30], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(temp_r31->mdlId[temp_r30], HU3D_MOTATTR_LOOP);
        Hu3DMotionTimeSet(temp_r31->mdlId[temp_r30], (1.0f / 255.0f) * (Hu3DMotionMaxTimeGet(temp_r31->mdlId[temp_r30]) * frandu8()));
        temp_r28[temp_r30] = 0;
    }
}

void fn_2_DE1C(WorkE6E8 *arg0)
{
    HuMemDirectFree(arg0->unk34);
    HuMemDirectFree(arg0->unk38);
    HuMemDirectFree(arg0->unk40);
    HuMemDirectFree(arg0->unk44);
    HuMemDirectFree(arg0->unk48);
    HuMemDirectFree(arg0->unk4C);
    HuMemDirectFree(arg0->unk3C);
    HuMemDirectFree(arg0->unk50);
    HuMemDirectFree(arg0->unk54);
    HuMemDirectFree(arg0->unk58);
    HuMemDirectFree(arg0->unk5C);
    HuMemDirectFree(arg0->unk60);
    HuMemDirectFree(arg0->unk64);
    HuMemDirectFree(arg0->unk68);
    HuMemDirectFree(arg0->unk30);
}

OMOBJ *fn_2_DEBC(s16 arg0)
{
    WorkE6E8 *temp_r31;
    s32 temp_r29;
    OMOBJ *temp_r28;
    s32 temp_r27;
    s8 *temp_r26;
    if (arg0 <= 0) {
        return NULL;
    }
    temp_r28 = omAddObjEx(lbl_2_bss_1C, 1145, arg0, 0, -1, NULL);
    omSetStatBit(temp_r28, 0x100);
    temp_r28->data = HuMemDirectMallocNum(HEAP_HEAP, sizeof(WorkE6E8), HU_MEMNUM_OVL);
    temp_r31 = temp_r28->data;
    temp_r31->unk34 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(Vec), HU_MEMNUM_OVL);
    temp_r31->unk38 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(Vec), HU_MEMNUM_OVL);
    temp_r31->unk40 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(Vec), HU_MEMNUM_OVL);
    temp_r31->unk44 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(Vec), HU_MEMNUM_OVL);
    temp_r31->unk48 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(Vec), HU_MEMNUM_OVL);
    temp_r31->unk4C = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(Vec), HU_MEMNUM_OVL);
    temp_r31->unk3C = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(Vec), HU_MEMNUM_OVL);
    temp_r31->unk50 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(s16), HU_MEMNUM_OVL);
    temp_r31->unk54 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(s16), HU_MEMNUM_OVL);
    temp_r31->unk58 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(float), HU_MEMNUM_OVL);
    temp_r31->unk5C = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(float), HU_MEMNUM_OVL);
    temp_r31->unk60 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(float), HU_MEMNUM_OVL);
    temp_r31->unk64 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(float), HU_MEMNUM_OVL);
    temp_r31->unk68 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(float), HU_MEMNUM_OVL);
    temp_r31->unk30 = HuMemDirectMallocNum(HEAP_HEAP, arg0 * sizeof(s8), HU_MEMNUM_OVL);
    for (temp_r27 = 0; temp_r27 < arg0; temp_r27++) {
        temp_r26 = lbl_2_bss_C4->data;
        for (temp_r29 = 0; temp_r29 < lbl_2_bss_C4->work[0]; temp_r29++) {
            if (temp_r26[temp_r29] == 0) {
                temp_r26[temp_r29] = 1;
                temp_r28->mdlId[temp_r27] = lbl_2_bss_C4->mdlId[temp_r29];
                temp_r31->unk54[temp_r27] = temp_r29 % 3;
                temp_r31->unk30[temp_r27] = temp_r29;
                break;
            }
        }
        if (temp_r29 == lbl_2_bss_C4->work[0]) {
            arg0 -= (s32)arg0 - temp_r27;
            break;
        }
    }
    if (arg0 == 0) {
        fn_2_DE1C(temp_r31);
        omDelObjEx(HuPrcCurrentGet(), temp_r28);
        temp_r28 = NULL;
    }
    else {
        temp_r31->unk0 = arg0;
        temp_r31->unk10 = 0;
    }
    return temp_r28;
}

void fn_2_E24C(OMOBJ *object)
{
    WorkE6E8 *temp_r31;
    s32 temp_r30;
    s8 *temp_r28;
    temp_r31 = object->data;
    temp_r28 = lbl_2_bss_C4->data;
    for (temp_r30 = 0; temp_r30 < temp_r31->unk0; temp_r30++) {
        temp_r28[temp_r31->unk30[temp_r30]] = 0;
        Hu3DModelAttrSet(object->mdlId[temp_r30], HU3D_ATTR_DISPOFF);
    }
    fn_2_DE1C(temp_r31);
    omDelObjEx(HuPrcCurrentGet(), object);
}

void fn_2_E6E8(OMOBJ *object);

void fn_2_E364(OMOBJ *object, s16 arg1)
{
    s32 temp_r31;
    WorkE6E8 *temp_r29 = object->data;
    if (arg1 == 1) {
        for (temp_r31 = 0; temp_r31 < temp_r29->unk0; temp_r31++) {
            Hu3DModelAttrReset(object->mdlId[temp_r31], HU3D_ATTR_DISPOFF);
        }
        object->objFunc = fn_2_E6E8;
    }
    else {
        for (temp_r31 = 0; temp_r31 < temp_r29->unk0; temp_r31++) {
            Hu3DModelAttrSet(object->mdlId[temp_r31], HU3D_ATTR_DISPOFF);
        }
        object->objFunc = NULL;
    }
}

void fn_2_E420(OMOBJ *object, Vec *arg1, Vec *arg2)
{
    WorkE6E8 *temp_r31 = object->data;
    s32 temp_r30;
    for (temp_r30 = 0; temp_r30 < temp_r31->unk0; temp_r30++) {
        temp_r31->unk34[temp_r30].x = (arg1->x - arg2->x) + ((1.0f / 255.0f) * (2.0f * arg2->x * frandu8()));
        temp_r31->unk34[temp_r30].y = (arg1->y - arg2->y) + ((1.0f / 255.0f) * (2.0f * arg2->y * frandu8()));
        temp_r31->unk34[temp_r30].z = (arg1->z - arg2->z) + ((1.0f / 255.0f) * (2.0f * arg2->z * frandu8()));
        VECNormalize(&temp_r31->unk34[temp_r30], &temp_r31->unk38[temp_r30]);
        temp_r31->unk5C[temp_r30] = temp_r31->unk64[temp_r30] = temp_r31->unk60[temp_r30] = temp_r31->unk68[temp_r30] = 0;
        temp_r31->unk58[temp_r30] = 0.1f;
        Hu3DModelPosSet(object->mdlId[temp_r30], temp_r31->unk34[temp_r30].x, temp_r31->unk34[temp_r30].y, temp_r31->unk34[temp_r30].z);
    }
}

