mariopartyrd/marioparty4/src/REL/m401Dll/main.c
void fn_2_E66C(OMOBJ *object, Vec *pos)
{
    WorkE6E8 *temp_r31 = object->data;
    temp_r31->unk4 = *pos;
}

void fn_2_E69C(OMOBJ *object, float arg2, float arg3)
{
    WorkE6E8 *temp_r31 = object->data;
    temp_r31->unk14 = arg2;
    temp_r31->unk18 = arg3;
}

void fn_2_E6BC(OMOBJ *object, float arg2, float arg3, float arg4, float arg5, float arg6)
{
    WorkE6E8 *temp_r31 = object->data;
    temp_r31->unk1C = arg2;
    temp_r31->unk20 = arg3;
    temp_r31->unk24 = arg4;
    temp_r31->unk28 = arg5;
    temp_r31->unk2C = arg6;
}

void fn_2_E6E8(OMOBJ *object)
{
    WorkE6E8 *temp_r31 = object->data;
    s32 temp_r30;
    s32 temp_r29;
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    float temp_f27;
    Mtx sp158, sp128, spF8, spC8, sp98, sp68;
    Vec sp5C, sp50, sp44, sp38, sp2C, sp20, sp14, sp8;
    for (temp_r30 = 0; temp_r30 < temp_r31->unk0; temp_r30++) {
        temp_r31->unk3C[temp_r30].x = 0;
        temp_r31->unk3C[temp_r30].y = 0;
        temp_r31->unk3C[temp_r30].z = 0;
        temp_r31->unk40[temp_r30].x = 0;
        temp_r31->unk40[temp_r30].y = 0;
        temp_r31->unk40[temp_r30].z = 0;
        temp_r31->unk44[temp_r30].x = 0;
        temp_r31->unk44[temp_r30].y = 0;
        temp_r31->unk44[temp_r30].z = 0;
        temp_r31->unk48[temp_r30].x = 0;
        temp_r31->unk48[temp_r30].y = 0;
        temp_r31->unk48[temp_r30].z = 0;
        temp_r31->unk4C[temp_r30].x = 0;
        temp_r31->unk4C[temp_r30].y = 0;
        temp_r31->unk4C[temp_r30].z = 0;
        temp_r31->unk50[temp_r30] = 0;
    }
    for (temp_r30 = 0; temp_r30 < temp_r31->unk0; temp_r30++) {
        for (temp_r29 = temp_r30 + 1; temp_r29 < temp_r31->unk0; temp_r29++) {
            VECSubtract(&temp_r31->unk34[temp_r30], &temp_r31->unk34[temp_r29], &sp5C);
            temp_f28 = VECMag(&sp5C);
            if (temp_f28 < temp_r31->unk14) {
                VECScale(&sp5C, &sp50, 1.0f / (temp_f28 * temp_f28));
                VECAdd(&temp_r31->unk3C[temp_r30], &sp50, &temp_r31->unk3C[temp_r30]);
                VECSubtract(&temp_r31->unk3C[temp_r29], &sp50, &temp_r31->unk3C[temp_r29]);
                if (temp_r31->unk54[temp_r30] == temp_r31->unk54[temp_r29]) {
                    VECScale(&temp_r31->unk38[temp_r29], &sp50, 1.0f / temp_f28);
                    VECAdd(&temp_r31->unk40[temp_r30], &sp50, &temp_r31->unk40[temp_r30]);
                    VECScale(&temp_r31->unk38[temp_r30], &sp50, 1.0f / temp_f28);
                    VECAdd(&temp_r31->unk40[temp_r29], &sp50, &temp_r31->unk40[temp_r29]);
                    VECAdd(&temp_r31->unk44[temp_r30], &temp_r31->unk34[temp_r29], &temp_r31->unk44[temp_r30]);
                    VECAdd(&temp_r31->unk44[temp_r29], &temp_r31->unk34[temp_r30], &temp_r31->unk44[temp_r29]);
                }
                temp_r31->unk50[temp_r30]++;
                temp_r31->unk50[temp_r29]++;
            }
        }
        for (temp_r29 = 0; temp_r29 < 4; temp_r29++) {
            sp44.x = lbl_2_bss_118[temp_r29]->trans.x;
            sp44.y = lbl_2_bss_118[temp_r29]->trans.y;
            sp44.z = lbl_2_bss_118[temp_r29]->trans.z;
            VECSubtract(&temp_r31->unk34[temp_r30], &sp44, &sp38);
            if (!(VECDotProduct(&sp38, &temp_r31->unk38[temp_r30]) > 0)) {
                temp_f30 = VECMag(&sp38) - 200;
                if (temp_f30 < temp_r31->unk14) {
                    temp_f30 -= 100;
                    if (temp_f30 < 0.01f) {
                        temp_f30 = 0.01f;
                    }
                    VECScale(&sp38, &sp38, 1.0f / temp_f30);
                    VECAdd(&temp_r31->unk4C[temp_r30], &sp38, &temp_r31->unk4C[temp_r30]);
                }
            }
        }
        if (temp_r31->unk50[temp_r30] != 0) {
            VECScale(&temp_r31->unk44[temp_r30], &temp_r31->unk44[temp_r30], 1.0f / temp_r31->unk50[temp_r30]);
            VECSubtract(&temp_r31->unk44[temp_r30], &temp_r31->unk34[temp_r30], &sp2C);
            temp_f29 = VECMag(&sp2C);
            if (temp_f29 > 0.0f) {
                VECScale(&sp2C, &temp_r31->unk44[temp_r30], 1.0f / temp_f29);
            }
            else {
                temp_r31->unk44[temp_r30].x = 0;
                temp_r31->unk44[temp_r30].y = 0;
                temp_r31->unk44[temp_r30].z = 0;
            }
            VECScale(&temp_r31->unk40[temp_r30], &temp_r31->unk40[temp_r30], 1.0f / temp_r31->unk50[temp_r30]);
            temp_f29 = VECMag(&temp_r31->unk40[temp_r30]);
            if (temp_f29 > 0) {
                VECScale(&temp_r31->unk40[temp_r30], &temp_r31->unk40[temp_r30], 1.0f / temp_f29);
                VECSubtract(&temp_r31->unk40[temp_r30], &temp_r31->unk38[temp_r30], &sp2C);
                VECScale(&sp2C, &temp_r31->unk40[temp_r30], 1.0f / temp_f29);
            }
        }
        VECSubtract(&temp_r31->unk4, &temp_r31->unk34[temp_r30], &temp_r31->unk48[temp_r30]);
        VECNormalize(&temp_r31->unk48[temp_r30], &temp_r31->unk48[temp_r30]);
    }
    for (temp_r30 = 0; temp_r30 < temp_r31->unk0; temp_r30++) {
        sp20.x = 0;
        sp20.y = 0;
        sp20.z = 0;
        VECScale(&temp_r31->unk3C[temp_r30], &sp8, temp_r31->unk1C);
        VECAdd(&sp8, &sp20, &sp20);
        VECScale(&temp_r31->unk4C[temp_r30], &sp8, temp_r31->unk20);
        VECAdd(&sp8, &sp20, &sp20);
        VECScale(&temp_r31->unk40[temp_r30], &sp8, temp_r31->unk24);
        VECAdd(&sp8, &sp20, &sp20);
        VECScale(&temp_r31->unk44[temp_r30], &sp8, temp_r31->unk28);
        VECAdd(&sp8, &sp20, &sp20);
        VECScale(&temp_r31->unk48[temp_r30], &sp8, temp_r31->unk2C);
        VECAdd(&sp8, &sp20, &sp20);
        temp_f27 = VECMag(&sp20);
        if (temp_f27 > 1.0f) {
            VECScale(&sp20, &sp20, 1.0f / temp_f27);
        }
        if (sp20.y > 0.01f) {
            temp_r31->unk60[temp_r30] += 0.02f;
            if (temp_r31->unk60[temp_r30] > 0.8f) {
                temp_r31->unk60[temp_r30] = 0.8f;
            }
        }
        else {
            if (sp20.y < -0.01f) {
                temp_r31->unk60[temp_r30] -= 0.02f;
                if (temp_r31->unk60[temp_r30] < -0.8f) {
                    temp_r31->unk60[temp_r30] = -0.8f;
                }
            }
            else {
                temp_r31->unk60[temp_r30] *= 0.98f;
            }
        }
        temp_r31->unk58[temp_r30] -= 0.002 * temp_r31->unk60[temp_r30];
        temp_r31->unk58[temp_r30] = temp_r31->unk18 + (0.99f * (temp_r31->unk58[temp_r30] - temp_r31->unk18));
        if (temp_r31->unk58[temp_r30] < 0.4f * temp_r31->unk18) {
            temp_r31->unk58[temp_r30] = 0.4f * temp_r31->unk18;
        }
        if (temp_r31->unk58[temp_r30] > 5.0f * temp_r31->unk18) {
            temp_r31->unk58[temp_r30] = 5.0f * temp_r31->unk18;
        }
        sp14 = sp20;
        sp14.y = 0;
        sp8 = temp_r31->unk38[temp_r30];
        if (VECMag(&sp14) > 0) {
            VECNormalize(&sp14, &sp14);
        }
        temp_f31 = VECDotProduct(&sp14, &sp8);
        if (temp_f31 > 0.7f) {
            temp_f31 -= 0.7f;
            temp_r31->unk58[temp_r30] += 0.005f * temp_f31;
        }
        VECCrossProduct(&sp14, &sp8, &sp14);
        temp_f31 = 0.07f * ((1.0f - temp_f31) / 2);
        if (sp14.y > 0.05f) {
            temp_r31->unk68[temp_r30] = 0.05f * (temp_f31 + (19.0f * temp_r31->unk68[temp_r30]));
        }
        else if (sp14.y < -0.05f) {
            temp_r31->unk68[temp_r30] = 0.05f * ((19.0f * temp_r31->unk68[temp_r30]) - temp_f31);
        }
        else {
            temp_r31->unk68[temp_r30] *= 0.98f;
        }
        temp_r31->unk5C[temp_r30] += temp_r31->unk68[temp_r30];
        temp_r31->unk64[temp_r30] = 20.0f * -temp_r31->unk68[temp_r30];
        MTXTrans(sp158, temp_r31->unk34[temp_r30].x, temp_r31->unk34[temp_r30].y, temp_r31->unk34[temp_r30].z);
        MTXRotDeg(sp128, 'x', (temp_r31->unk60[temp_r30] / M_PI) * 180.0);
        MTXRotDeg(spF8, 'y', (temp_r31->unk5C[temp_r30] / M_PI) * 180.0);
        MTXRotDeg(spC8, 'z', (temp_r31->unk64[temp_r30] / M_PI) * 180.0);
        MTXConcat(sp128, spF8, sp98);
        MTXConcat(spC8, sp98, sp68);
        MTXConcat(sp68, sp158, sp98);
        temp_r31->unk38[temp_r30].x = MTXRowCol(sp98, 2, 0);
        temp_r31->unk38[temp_r30].y = MTXRowCol(sp98, 2, 1);
        temp_r31->unk38[temp_r30].z = MTXRowCol(sp98, 2, 2);
        temp_r31->unk34[temp_r30].x += 100.0f * (temp_r31->unk38[temp_r30].x * temp_r31->unk58[temp_r30]);
        temp_r31->unk34[temp_r30].y += 100.0f * (temp_r31->unk38[temp_r30].y * temp_r31->unk58[temp_r30]);
        temp_r31->unk34[temp_r30].z += 100.0f * (temp_r31->unk38[temp_r30].z * temp_r31->unk58[temp_r30]);
        if (temp_r31->unk34[temp_r30].y < -350.0f) {
            temp_r31->unk34[temp_r30].y = -350.0f;
        }
        Hu3DModelPosSet(object->mdlId[temp_r30], temp_r31->unk34[temp_r30].x, temp_r31->unk34[temp_r30].y, temp_r31->unk34[temp_r30].z);
        Hu3DModelRotSet(object->mdlId[temp_r30], (-temp_r31->unk60[temp_r30] / M_PI) * 180.0, (-temp_r31->unk5C[temp_r30] / M_PI) * 180.0, 0);
    }
}

void fn_2_F778()
{
    HU3DCAMERA *temp_r31;
    s32 temp_r30;
    float sp8[7];
    temp_r31 = lbl_2_bss_DC->data;
    sp8[0] = temp_r31->pos.x;
    sp8[1] = temp_r31->pos.y;
    sp8[2] = temp_r31->pos.z;
    sp8[3] = temp_r31->up.x;
    sp8[4] = temp_r31->up.y;
    sp8[5] = temp_r31->up.z;
    sp8[6] = temp_r31->target.x;
    fontcolor = FONT_COLOR_WHITE;
    for (temp_r30 = 0; temp_r30 < 7; temp_r30++) {
        if (temp_r30 == lbl_2_bss_18) {
            print8(24.0 + (1.5 * ((temp_r30 * 8) * 7)), 384, 1.5f, "____");
        }
        print8(24.0 + (1.5 * ((temp_r30 * 8) * 7)), 400, 1.5f, "%.2f", sp8[temp_r30]);
    }
    if (HuPadBtnRep[0] & PAD_BUTTON_LEFT) {
        if (--lbl_2_bss_18 < 0) {
            lbl_2_bss_18 = 6;
        }
    }
    if (HuPadBtnRep[0] & PAD_BUTTON_RIGHT) {
        if (++lbl_2_bss_18 > 6) {
            lbl_2_bss_18 = 0;
        }
    }
    if (HuPadBtnRep[0] & PAD_BUTTON_UP) {
        if (HuPadBtn[0] & PAD_TRIGGER_R) {
            sp8[lbl_2_bss_18] += 1.0f;
        }
        else if (HuPadBtn[0] & PAD_TRIGGER_L) {
            sp8[lbl_2_bss_18] += 0.1f;
        }
        else {
            sp8[lbl_2_bss_18] += 0.01f;
        }
        if (sp8[lbl_2_bss_18] > 999.99f) {
            sp8[lbl_2_bss_18] = 999.99f;
        }
    }
    if (HuPadBtnRep[0] & PAD_BUTTON_DOWN) {
        if (HuPadBtn[0] & PAD_TRIGGER_R) {
            sp8[lbl_2_bss_18] -= 1.0f;
        }
        else if (HuPadBtn[0] & PAD_TRIGGER_L) {
            sp8[lbl_2_bss_18] -= 0.1f;
        }
        else {
            sp8[lbl_2_bss_18] -= 0.01f;
        }
        if (sp8[lbl_2_bss_18] < 0) {
            sp8[lbl_2_bss_18] = 0;
        }
    }
    temp_r31->pos.x = sp8[0];
    temp_r31->pos.y = sp8[1];
    temp_r31->pos.z = sp8[2];
    temp_r31->up.x = sp8[3];
    temp_r31->up.y = sp8[4];
    temp_r31->up.z = sp8[5];
    temp_r31->target.x = sp8[6];
}

void fn_2_FF98(OMOBJ *object);

OMOBJ *fn_2_FC40(s16 arg0, Vec *arg1, Vec *arg2, Vec *arg3)
{
    OMOBJ *temp_r30;
    OMOBJ *temp_r22;
    temp_r22 = omAddObjEx(HuPrcCurrentGet(), 1140, 0, 0, -1, fn_2_FF98);
    temp_r30 = fn_2_DEBC(arg0);
    temp_r22->work[0] = (u32)temp_r30;
    fn_2_E420(temp_r30, arg1, arg2);
    fn_2_E66C(temp_r30, arg3);
    fn_2_E69C(temp_r30, 90.0f, 0.045999996f);
    fn_2_E6BC(temp_r30, 5.0f, 1.5f, 0.08f, 0.8f, 0.8f);
    fn_2_E364(temp_r30, 1);
    return temp_r22;
}

void fn_2_FF98(OMOBJ *object)
{
    WorkE6E8 *temp_r29;
    OMOBJ *temp_r28;
    s32 temp_r25;
    s32 temp_r24;
    temp_r24 = 0;
    temp_r28 = (OMOBJ *)(object->work[0]);
    temp_r29 = temp_r28->data;
    temp_r29->unk4.x += object->scale.x * sind(object->trans.x);
    temp_r29->unk4.y += object->scale.y * sind(object->trans.x);
    temp_r29->unk4.z += object->scale.z * sind(object->trans.x);
    object->trans.x += object->rot.x;
    if (object->trans.x >= 360.0f) {
        object->trans.x -= 360.0f;
    }
    if (object->trans.x < 0.0f) {
        object->trans.x += 360.0f;
    }
    for (temp_r25 = 0; temp_r25 < temp_r29->unk0; temp_r25++) {
        if (temp_r29->unk34[temp_r25].z >= lbl_2_bss_6C.z) {
            temp_r24++;
        }
    }
    if (temp_r24 == temp_r29->unk0) {
        fn_2_E24C(temp_r28);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}
